{ "reviews": [
{
	"Date": "2021-08-01", 
	"Watched Date": "2021-06-01", 
	"Name": "Luca", 
	"Year": "2021", 
	"Rating": "3", 
	"Review": "Decent film. I loved the friendship aspect of this film. The two boys having a mutual situation but different perspectives provided a unique coming of age film.<br/><br/>With that, this film certainly had a Miyazaki-feel to it. The story seemed to stumble into the next scene as the characters happened to be subject to their immediate situation much like you see in Castle In the Sky or Spirited Away. I found this film endearing but has higher expectations regarding the lengths at which the story would go geographically and literally.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/3/8/7/2/2/438722-luca-0-230-0-345-crop.jpg"
},
{
	"Date": "2021-08-01", 
	"Watched Date": "2021-07-31", 
	"Name": "Black Widow", 
	"Year": "2021", 
	"Rating": "1", 
	"Review": "Subpar marvel movie, and that says a lot.<br/><br/>Black Widow as a character has so much mystery built up around her upbringing and it felt as though that was not addressed fully. The trauma we were told she experienced was different from what we saw. The story felt concocted as if Black Widow hit the scene as a character only in the last year.<br/><br/>I did enjoy the introduction of Yelena as a character into the MCU.<br/><br/>I hope that the Red Guardian returns as a villain in a Captain America film or featurette fighting off against either Steve Rogers or Isaiah Bradley (TFAWS).<br/><br/>Not my favorite MCU film and would have preferred as a short series as the MCU has gained a lot of traction and respect for their ability to pursue TV.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/2/7/8/0/7/427807-black-widow-0-230-0-345-crop.jpg"
},
{
	"Date": "2021-08-12", 
	"Watched Date": "2021-08-11", 
	"Name": "Mystic River", 
	"Year": "2003", 
	"Rating": "4", 
	"Review": "Sean Penn murders this film. Exceptional performance on his part. The film kicked off with a gripping and disturbing scene which pulled me in. The plot began from their with a gradual growth of intensity followed by the eventual murder of Dave and detainment of Ray Jr.<br/><br/><br/>The stylistic choice of using fade in/out cuts throughout the film were calming and only added to the consistent somber feel.<br/><br/>The overall grim tone of the was recognized in the music, darker color and madness that overcame Dave and Jimmy.<br/><br/><br/>I enjoyed the subtle symmetry between Dave’s survival instinct submission during his capture to his survival instinct compliance when Jimmy convinces him he will let Dave go if he says he killed Katie. Dave only reacts to survive.<br/><br/><b>Criticism</b><br/><br/>I don’t understand why Eastwood chose to continue the film past the confrontation after the murder between Dave and Jimmy.<br/><br/>The whole Sean (Kevin Bacon) love story was weak. I wish that portion of the film had been extrapolated on or removed from the film altogether. Jimmy and Sean have an emotional scene at the end of the film and Sean ends it by answering a call with his wife who recently left him in a happy tone, ignoring the fact that he was just told by Jimmy (Sean Penn) that he killed Dave (Tim Robbins).", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/7/3/7/51737-mystic-river-0-230-0-345-crop.jpg"
},
{
	"Date": "2021-08-14", 
	"Watched Date": "2021-08-13", 
	"Name": "The Suicide Squad", 
	"Year": "2021", 
	"Rating": "3.5", 
	"Review": "This is the redemption movie DC needed. After the flop that was the 2016 film of the same name, this Suicide Squad came thru with blunt comedy, just-the-right-amount of R-rated magic and the magnificent Peacemaker.<br/><br/>Off the bat, Peacemaker (John Cena) embodied the frat-boy-esc super hero you’d expect walking around in whitey tighties. His comedy was on point and his eventual plot twist was an enjoyable turn in the final act of the film.<br/><br/>James Gunn wasted no time diving straight into the film and expressing his love of music with Johnny Cash and his willingness to go R-rated with the initial killing off of half the Suicide Squad.<br/><br/>The scene at the bar about halfway thru the film was the only real time I felt the film diverted from what it embodied. The Suicide Squad is a group of villains imprisoned by the US government to fight or be killed by explosives in their spines. You wouldn’t expect them to enjoy a night out on the town drinking and laughing with one another with the irritation they have towards the situation and each other. This scene is especially odd when taking into account that the Squad just beforehand took out an entire town of freedom fighters by accident. This of course though is the way of James Gunn and he seemed to pull it off.<br/><br/>My rating is partly due to the redemptive nature of this film in light of its 2016 predecessor but also as a recognition to the way James Gunn was able to create a funny, emotionally-attaching, gory masterpiece out of a rag-tag group of super humans.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/6/9/8/3/5/369835-the-suicide-squad-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-08-29", 
	"Watched Date": "2022-08-28", 
	"Name": "The Batman", 
	"Year": "2022", 
	"Rating": "3.5", 
	"Review": "Great cinematography. Leaned more into the goth, emo side of Bats.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/4/8/9/1/4/348914-the-batman-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-08-30", 
	"Watched Date": "2022-08-29", 
	"Name": "Pulp Fiction", 
	"Year": "1994", 
	"Rating": "4.5", 
	"Review": "The simple, mindless conversations. That’s what makes this film and so many of Quentin Tarantino’s films so unique. Much like Aaron Sorkin, Tarantino’s writing is focused on intriguing social interactions that reflect more about the emotions and values of the character than the actual plot at hand.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/4/4/4/51444-pulp-fiction-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-07", 
	"Watched Date": "2022-09-06", 
	"Name": "Girl, Interrupted", 
	"Year": "1999", 
	"Rating": "3", 
	"Review": "Angelina Jolie stands out as a brilliant, demented patient.<br/><br/><br/>I expected Whoopi Goldberg’s character to play more of a Sean Maguire role (Robin Williams in Good Will Hunting) which tampered my view of the character as I didn’t feel she was as impactful as Robin. Maybe unfair comparison but regardless, wished for more from the strong individual Whoopie’s character was supposed to be", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/1x/ad/d5/5d/vp46lgVDiFdT4Hw5WIISOPwnMaH-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-12", 
	"Watched Date": "2022-09-11", 
	"Name": "Class Action Park", 
	"Year": "2020", 
	"Rating": "1.5", 
	"Review": "Just bad. As far as documentaries go this one sits at the bottom of the totem pole. The interviews were very planar; “yeah the park was crazy dangerous but we had fun”.<br/><br/>Equally confusing was the way the park’s creator, Gene, was villain-ized and then swiftly treated as an anti-disestablishment hero. The man’s ideas killed several people with no remorse.<br/><br/>The interviewees were off-pitch, strangely dramatic at times and unrewarding.<br/><br/>Quote: “when you talk to other people that went there, there’s a shared level of… sort of survivor’s respect.”", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/6/0/3/5/2/560352-class-action-park-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-17", 
	"Watched Date": "2022-09-16", 
	"Name": "The Shining", 
	"Year": "1980", 
	"Rating": "3.5", 
	"Review": "This film categorizes the slow, agonizing demise into chaos far too well.<br/><br/>Danny, Nicholson and Duvall all put up top tier performances each in their own, different ways.<br/><br/>Love the sound design. Particularly when Danny is riding around his tricycle on the soft, silky carpet compared to the rough, punchy sound of the hardwood.<br/><br/>The music makes the film. Builds a tense, heart-pounding atmosphere with wonder and terror.<br/><br/>Most modern horror films aren’t as drawn out and patient as The Shining. In many ways, the patience and cadence of the film puts weight behind the tension that builds to a climax.<br/><br/>I don’t think I’ll watch this film often, but when I do, my attention will be kept.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/7s/m2/bw/d0/caoYMcjUamGoBVy65i1AHJBvdzw-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-17", 
	"Watched Date": "2022-09-16", 
	"Name": "The Harder They Fall", 
	"Year": "2021", 
	"Rating": "2.5", 
	"Review": "Straight Outta Compton meets Tombstone.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/4/4/9/3/6/544936-the-harder-they-fall-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-28", 
	"Watched Date": "2022-09-27", 
	"Name": "Do Revenge", 
	"Year": "2022", 
	"Rating": "1.5", 
	"Review": "SPOILERS: Maya Hawke was the villain for 1.5 seconds. The weight of the twist and her betrayal was minuscule when it was meant to be a heavy moment of the film.<br/><br/>Very woke film", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/8/3/1/9/4/683194-do-revenge-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-09-28", 
	"Watched Date": "2022-09-27", 
	"Name": "Pleasantville", 
	"Year": "1998", 
	"Rating": "3", 
	"Review": "Lighthearted and fun.<br/><br/>The similarities between this film and the civil rights movements of the ‘60s was right on the nose. It put into perspective the need for change and self-expression.<br/><br/>Loved Tobey Maguire and Reese Witherspoon throughout especially how their journeys were swapped in some ways.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/0/1/6/4/50164-pleasantville-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-11-24", 
	"Watched Date": "2022-11-23", 
	"Name": "Falling for Christmas", 
	"Year": "2022", 
	"Rating": "0.5", 
	"Review": "Don’t ask why I watched this… thing. I feel ashamed already", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/4/8/6/7/9/748679-falling-for-christmas-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-11-24", 
	"Watched Date": "2022-11-23", 
	"Name": "Don't Worry Darling", 
	"Year": "2022", 
	"Rating": "2.5", 
	"Review": "Basically Black Mirror.<br/><br/>I found the final act 10x as compelling as the rest of the film. The first two acts take a while to take shape and the film doesn’t feel as grounded. I didn’t feel attached to Alice (Florence Pugh) as Olivia Wilde would have intended. The film felt weak and purposeless for a significant portion of time. Upon a second watch, I could see how the constant cuts to abnormal imagery would make it more intriguing for the first two acts.<br/><br/><b>SPOILERS!</b><br/>That being said, this film is made in the final act. I did not expect the simulation twist and it quelled my fears of a unfulfilled ending. I thought Jack’s (Harry Styles) character arc and persona was made whole in the final 20min of the film.<br/><br/>All around, could’ve been an hour long Black Mirror episode and would’ve ranked in the mid/high tier of quality in the lineup. <br/><br/>I found the film puzzling, the characters distrusting and the truth of Victory Project disturbing.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/4/6/3/4/7/546347-don-t-worry-darling-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-11-27", 
	"Watched Date": "2022-11-26", 
	"Name": "Barbarian", 
	"Year": "2022", 
	"Rating": "2", 
	"Review": "First off, Justin Long’s story arc - famous actor exposed by female costar for sexual assault - did not contribute to the film. The 5+ min it took to introduce him into the film felt unnecessary for an already short film. It gets into AJ’s evil nature later on which makes sense in the context of his expressed situation.<br/><br/>The only true surprise was Bill Skarsgard <b>wasn’t </b>the baddie, although I did assume he was cast to throw off the audience; I was partly right.<br/><br/>The cinematography was a bonus. Field of view increased as the character’s distress and fear increased. Shots were not jumpy either, average shot time <i>seemed </i>longer than normal (which is often a bonus in my book).<br/><br/>The use of light (and lack thereof) added fear and provoked curiosity in me. Red, pink and yellow lighting were used throughout strategically. <b>Yellow lighting </b>dominated the first night in the house with Tess (G Campbell) and Keith (B Skarsgard). I had the sense that this color represented safety with caution. We didn’t know who Keith was or what his intentions might be - untrustworthy! The flashlight and light in the basement light were yellow as well. The basement was a step closer to safety (in comparison to the dark, ominous hallway and below). The basement light was a beacon of hope when Tess and AJ escape from the caverns below. The flashlight represented the last sense of hope Tess or AJ had while navigating the caverns below. It literally led them to their escape and provided a path to safety. This hope was not without its own amount of caution though as darkness crept in from all non-lit areas.<b>Red lighting </b>is only used in scenes involving AJ (Justin Long). (1)When he is at a bar with his friend in Detroit telling the truth about “that encounter” with his (rightfully) convicting co-star and (2) When he and Tess are on top of the water tower escaping the Creature. In both scenes, AJ exposes his evilness. (1) brags about his “persistent” sexual nature and defends his innocence and (2) throws Tess off the tower in order to escape. <b>Pink lighting </b>was only used in the room where the Creature appeared to breast feed and seemingly sleep. Not even gonna try to guess what pink could represent.<br/><br/>As the monster arose from the darkness, fear slowly swelled in the character. I found this, as opposed to the jump scare, much more disturbing.<br/><br/>Was I scared, partly. Was I disturbed, I’ve been more disturbed from films of the same genre. This film did not hit my expectations. I had heard great reviews for this indie film from more than 5 people, including online rave reviews, and it underwhelmed any expectations I had.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/1/9/6/4/8/819648-barbarian-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-11-27", 
	"Watched Date": "2021-09-20", 
	"Name": "The Florida Project", 
	"Year": "2017", 
	"Rating": "5", 
	"Review": "Honest, raw, real, colorful and heartbreaking. I thought I’d see more Mickey Mouse though.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/2/8/5/3/8/328538-the-florida-project-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-12-22", 
	"Watched Date": "2022-12-20", 
	"Name": "Four Christmases", 
	"Year": "2008", 
	"Rating": "2.5", 
	"Review": "As far as romantic Christmas comedies go.. this is top tier. It fits in with the rest of American comedy trash but if you’re looking for a cheap Christmas comedy, you have it.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/4/7/1/3/44713-four-christmases-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-12-30", 
	"Watched Date": "2022-12-29", 
	"Name": "Bullet Train", 
	"Year": "2022", 
	"Rating": "3", 
	"Review": "Ladybug (Brad Pitt) says what the audience is thinking. Refreshing.<br/><br/>There were several small surprises and twists which made this film.<br/><br/>The constant Thomas the Tank Engine references, goofy backstories and Ladybug psychologically diagnosing himself/others made the film consistently funny throughout.<br/><br/>A goofy samurai movie that adds as a nice collection to David Leitch’s filmography", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/4/1/9/6/1/641961-bullet-train-0-230-0-345-crop.jpg"
},
{
	"Date": "2022-12-30", 
	"Watched Date": "2022-12-23", 
	"Name": "Glass Onion", 
	"Year": "2022", 
	"Rating": "3.5", 
	"Review": "Rian Johnson’s creativity and personality were clear in the cuts he chose<br/><br/>Loved the color in this film.<br/><br/>Daniel Craig is a stand out<br/><br/>Had no clue Edward Norton was the baddie til the end", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/8/6/7/2/3/586723-glass-onion-a-knives-out-mystery-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-02", 
	"Watched Date": "2023-01-01", 
	"Name": "King Kong", 
	"Year": "2005", 
	"Rating": "4.5", 
	"Review": "A landmark cinematic experience. The whole story flows throughout. Love the performances by Jack Black, Naomi Watts, Adrien Brody and Harambe. Each performance felt complex, nuanced and self-conflicted.<br/><br/>Most of the CGI still holds up better than some modern Marvel films.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/jb/d6/wt/v2/ueMFrWi2NTqvpDAUWh5lSewai8Q-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-02", 
	"Watched Date": "2020-05-01", 
	"Name": "If Beale Street Could Talk", 
	"Year": "2018", 
	"Rating": "4.5", 
	"Review": "The soundtrack elevates the emotion and composition of the film. Beautiful telling of a treacherous and segregation-heavy piece of America's past.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/9/7/5/7/8/397578-if-beale-street-could-talk-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-02", 
	"Watched Date": "2023-01-01", 
	"Name": "Amsterdam", 
	"Year": "2022", 
	"Rating": "2", 
	"Review": "Very dry, slow and emotionless. Lacks a consistent, continuous narrative arc. Lacks emotional investment: no danger felt by audience for the leading suspects of a murder.<br/><br/>I did enjoy the<i>Committee of the 5</i>being a US arm of the early Nazi party. This was the only interesting story piece to me.<br/><br/>Great cast, but the film doesn’t carry the punch it’s lineup and marketing campaign anticipated.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/8/9/3/1/7/589317-amsterdam-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-03", 
	"Watched Date": "2023-01-02", 
	"Name": "The French Dispatch", 
	"Year": "2021", 
	"Rating": "3.5", 
	"Review": "Wes Anderson’s take on the feature length short story model (similar to <i>The Ballad of Buster Scruggs</i>).<br/><br/>I very much enjoyed it. This Anderson film felt the most sophisticated, posh and arrogant. I didn’t mind that as much as it still held up in wittiness, humor and against-the-grain form.<br/><br/>I welcomed the technique of speaking directly to the audience via newspaper article narration. It provided comfort like my hand was being held through the journey.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/1/2/0/7/471207-the-french-dispatch-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-03", 
	"Watched Date": "2023-01-02", 
	"Name": "White Noise", 
	"Year": "2022", 
	"Rating": "3", 
	"Review": "It is nothing like the trailer. Descends into something I didn’t expect.<br/><br/>Colorful, sophisticated and haunting satire. Baumbach has delivered something different and delightful in comparison to his critically acclaimed <i>A Marriage Story.</i><br/><i><br/></i><br/>I haven’t read the book, but hope the film did it justice.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/6/6/2/6/9/666269-white-noise-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-03", 
	"Watched Date": "2023-01-02", 
	"Name": "Avatar: The Way of Water", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "The army storyline was very underdeveloped and took too many shortcuts. The story felt slightly Disney-ified/American-ized. Less so compared to the Marvel films.<br/><br/>CGI was 5/5.<br/>Scenes involving humans were 2/5.<br/>Water scenes 5/5.<br/>The Weeknd as the end credits song 0/5.<br/>Emotional draw 6/5. Lauren and I cried a lot.<br/><br/>As a launching point for several more sequels, I thought James Cameron did swell.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/3/0/5/8/63058-avatar-the-way-of-water-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-04", 
	"Watched Date": "2022-12-03", 
	"Name": "The Redeem Team", 
	"Year": "2022", 
	"Rating": "1", 
	"Review": "My one star is for Kobe. Wasn’t well constructed or impactful. Cool BTS footage though", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/9/1/7/7/8/0/917780-the-redeem-team-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-07", 
	"Watched Date": "2023-01-06", 
	"Name": "Brokeback Mountain", 
	"Year": "2005", 
	"Rating": "4", 
	"Review": "A story of regret, prejudice, desire and rejection which leaves the audience heartbroken and broadened. Slow paced and soft-toned in it's telling, Lee tackles a combination of place and agenda that few have engaged with. The audience walks away with a more nuanced perspective of the rancher archetype: A rugged individual whose desire, duty and conformity are all at odds. This ain't your John Wayne cowboy.<br/><br/>Regarding cinematography, Lee utilizes camera and production technics from last 19th century westerns throughout. The style leans towards fade cuts and far moving shots; reminiscent of rhinestone cowboy era films. I like to think this choice of technique was a nod to those older westerns; none of which took on the contentious subject of homosexuality. <i>The Power of the Dog (2021)</i>being the only other film of the same genre tackling this subject as far as I’m aware.<br/><br/>The conflict style is unique as it reflects<i>Man v. Man v. Society </i>while simultaneously <i>Man and Man v. Society</i>. Ennis and Jake are constantly split between conforming to social norms and confronting their desires. The familial tension leaves all parties confused and lost. The attitudes towards Ennis and Jake are brutal and aggressive.<br/><br/>This film is gentle and paced-well in it's telling while also being a brutal, heartbreaking tale.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/9/0/9/51909-brokeback-mountain-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-08", 
	"Watched Date": "2023-01-07", 
	"Name": "The Neighbors' Window", 
	"Year": "2019", 
	"Rating": "3.5", 
	"Review": "Exactly what I’d expect out of a short film. Simple message, simple delivery. Beautiful glimpse of middle class family life in the Big Apple.<br/><br/>Takeaway: Grass is always greener on the other side<br/>Only real downside: The dad sounded a lot like fake celeb Scott Dissick.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/2/7/7/9/5/527795-the-neighbors-window-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-09", 
	"Watched Date": "2023-01-08", 
	"Name": "The Greatest Showman", 
	"Year": "2017", 
	"Rating": "2", 
	"Review": "I found the first 15 minutes delightful and grand. I’ll admit I walked away a bit inspired and empowered. This film is whimsical. Michael Gracey tackles interpersonal and societal shortcomings including racial discrimination and the power of greed; and yet, these are addressed at the most surface level, with only cliches left for the audience.<br/><br/>None of this is what people really come for though. The audience comes for the music and choreography. Personal preference: I am not a fan of the pop-centric (sometimes electric and auto-tuned) musical styles in this soundtrack. It has <i>a few </i>gems in <i>a few</i>songs. I acknowledge the popularity with the younger crowd; just wasn’t for me.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/4/3/0/6/3/243063-the-greatest-showman-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-12", 
	"Watched Date": "2023-01-11", 
	"Name": "The Florida Project", 
	"Year": "2017", 
	"Rating": "5", 
	"Review": "The colors shine bright but not as much as the poverty, innocence and brutality expressed throughout", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/2/8/5/3/8/328538-the-florida-project-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-13", 
	"Watched Date": "2023-01-12", 
	"Name": "The Lobster", 
	"Year": "2015", 
	"Rating": "4", 
	"Review": "Black comedy is not a genre for everyone. I found the humor extremely dry, slow-paced and subtle... it was hilariously dreary.<br/><br/>The music is punchy, tense and aggressive. The string ensembles, throughout the film's soundtrack, build on anxiety and chaos to propel the film into a gradual downfall adventure.<br/><br/>This dystopian depiction cuts against the grain of the genre-average as it excludes any lords, flies and lords of flies. It has no terminators. No explosions or laser guns. David (Colin Farrell) attempts to live like a romantic vigilante; but in reality he's just a lump surrounded by a bunch of socially-inept lumps trying to escape the forced-companionship social impositions. It's a quaint story about loneliness and the most \"office space appropriate\" approach to breaking the law. <br/><br/>Rachel Weisz and Colin Farrell are comedic gold. Both with their timing and bleakness. When Short Sighted Woman (Rachel Weisz) describes the secret sign language she and David created to say \"I love you\" (and much more).. I about fell off my seat. \"Would you like to play another game of 'touch-guess-think-win'\" after Rachel's character tells David she's blind.. I about croaked. The  \"Arrive to the city\" scene is just the best. The wild interest each of the characters have for common grocery store items fits so well into the paling world Yorgos Lanthimos manifests. And my lord these shots. The depth of focus and environment in each shot is incredible. The camera never settles to splash in unconventional angles to remind the audience of the cinematographer's ego :)<br/><br/>This wasn't just a comedy, romance or dystopian film. And it doesn't fit into the mainstream sense of any of those genres. The comedy is dry and bleak; less direct or slap stick. The romance is dry and bleak; less charming, predictable or pleasant. The dystopian aspects are subtle and work appropriate; less cataclysmic and action-packed. My wife put it best, \"It's not a story you can relate to.\"", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/7/8/1/2/3/178123-the-lobster-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-15", 
	"Watched Date": "2022-04-14", 
	"Name": "Big Fish", 
	"Year": "2003", 
	"Rating": "4.5", 
	"Review": "Can’t watch without cry… absolutely sobbing. What a wild, turbulent, wholesome dream of a story.<br/><blockquote>Sandra Templeton, I love you and I WILL marry you.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/w2/v9/2v/lv/6DRFdlNZpAaEt7eejsbAlJGgaM7-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-16", 
	"Watched Date": "2023-01-15", 
	"Name": "Dog", 
	"Year": "2022", 
	"Rating": "1.5", 
	"Review": "A theater-grade Hallmark film. Tatum is back in his type-cast role. Some scenes started promising and ended so poorly. It lacks any depth. And still, the cinematography holds up.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/5/3/1/8/1/553181-dog-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-16", 
	"Watched Date": "2023-01-15", 
	"Name": "August: Osage County", 
	"Year": "2013", 
	"Rating": "4", 
	"Review": "Surreal performances by Julia Roberts and Meryl Streep. What a stand out film about loss, grief and deep-seeded familial turmoil. This is a family reunion where everyone leaves with more than a few emotional scars. The whole cast delivers a beautiful portrayal of heartache and bitterness.<br/><br/><blockquote><br/>\"Thank god we can't tell the future. We'd never get out of bed.”</blockquote><blockquote>“She might share some of the responsibility. It’s not cut and dried. It lives where everything lives. Somewhere in the middle, where the rest of us live. “</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/1/4/6/6/1/114661-august-osage-county-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-17", 
	"Watched Date": "2023-01-16", 
	"Name": "What's Eating Gilbert Grape", 
	"Year": "1993", 
	"Rating": "3", 
	"Review": "Sorry Johnny, Leo is the stand out in this one. While Gilbert's story is clearly the central, and strongest, of this film, I found Arnie (Leonardo DiCaprio) so intriguing. This film follows a young man with a heavy burden (no pun intended) he can’t handle, but he acts like a grown up Casanova.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/30/7g/xk/6u/8FxWgsfDNosewo7H65oE4QkOb7g-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-17", 
	"Watched Date": "2011-11-12", 
	"Name": "Surf's Up", 
	"Year": "2007", 
	"Rating": "3.5", 
	"Review": "Cody Maverick is Plat tier on all levels. Most quotable lines in a movie, hands down.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/1/8/8/47188-surf-s-up-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-17", 
	"Watched Date": "2023-01-16", 
	"Name": "Jurassic World Dominion", 
	"Year": "2022", 
	"Rating": "1", 
	"Review": "Dinosaurs everywhere. Another studio cash grab with absolutely no sensible plot. It tried soo hard to be an Indiana Jones movie and, just like the two predecessors, failed to capture the magic of <i>Jurassic Park (1993)</i>. Cool seeing velociraptors hunt bunnies though.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/3/7/0/5/0/437050-jurassic-world-dominion-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-18", 
	"Watched Date": "2022-12-28", 
	"Name": "Spider-Man: No Way Home", 
	"Year": "2021", 
	"Rating": "2.5", 
	"Review": "Loved when Peter asks Dr. Strange “you can do that?” after suggesting Peter should plead his case to MIT. Seems relatable.<br/><br/>Watching this again makes you realize just how childish Peter is. It also makes you really want to watch it again, for the first time, with a ton of people. After the second watch I noticed the plot issues. The comedy and triumphs are cheap. Holds up for most times breaking the fourth wall for the sake of nostalgia and relatability. Cool to see Tobey and Andrew again. Won’t have a crazy crossover event at this scale ever again. Most of my stars go to that.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/6/0/7/8/7/560787-spider-man-no-way-home-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-21", 
	"Watched Date": "2021-09-17", 
	"Name": "Moneyball", 
	"Year": "2011", 
	"Rating": "4.5", 
	"Review": "Very cathartic. One of Sorkin’s landmark creations.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/h1/fd/pz/pi/3oAa8mJJ97CH9AeGEY6vjAxqcvZ-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-21", 
	"Watched Date": "2023-01-20", 
	"Name": "About Time", 
	"Year": "2013", 
	"Rating": "4.5", 
	"Review": "Just absolutely heartwarming and soul-touching. Strong cadence; the whole film flowed rhythmically. Subtly hilarious and beautifully written. I was consistently encouraged by each and every story point. The arc of Tim's courtship of Charlotte, the journey of Mary and Tim and the bittersweet death of a beloved patriarch. Each so wonderfully and genuinely done. The premise could easily have been executed in a cheap and dry manner; Yet the exact opposite is delivered. A delightful execution of one man’s unique, temporally revised destiny.<br/><br/>The cast was incredible. Gleeson and McAdams stand out in this stunning rom com. Very cool seeing Tom Hollander (<i>White Lotus Season 2</i>), Vanessa Kirby (<i>The Crown</i>) and Richard Griffiths (<i>Harry Potter</i>) play small yet memorable roles.<br/><br/>And the soundtrack! Felt right with the film.. stands above a cheesy rom com soundtrack with flare and impact.<br/><blockquote>“You have to use it for things you really think will make your life the way you want it to be.”</blockquote><blockquote>\"I am so... disinterested in a life without your father.\"</blockquote><blockquote>“No one can ever prepare you for what happens when you have a child... When you see the baby in your arms and you know that's your job now. No one can prepare you for the love and the fear. There are other things, of course - no one can prepare you for the bad nappies... No one can prepare you for the love people you love can feel for them... And nothing can prepare you for the indifference of friends who don't have babies...\"</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/uo/th/yf/uz/zSuh8dGwqpsWR7ccvYbfxbSZ37o-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-21", 
	"Watched Date": "2022-03-25", 
	"Name": "The Dirt", 
	"Year": "2019", 
	"Rating": "1.5", 
	"Review": "I couldn’t have cared less about the early roots of Motley Crue after watching the first half of this film. A poorly acted and poorly written piece of cheap cinema.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/pw/n8/es/nz/xGY5rr8441ib0lT9mtHZn7e8Aay-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-22", 
	"Watched Date": "2022-07-14", 
	"Name": "Thor: Love and Thunder", 
	"Year": "2022", 
	"Rating": "2", 
	"Review": "Fell below expectations. Romance wasn’t real enough for me to care. Christian Bale can’t bloom under these conditions.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/4/3/0/0/2/543002-thor-love-and-thunder-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-23", 
	"Watched Date": "2023-01-22", 
	"Name": "The Banshees of Inisherin", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "What should be done about a relationship grown dull? What is the value of aimlessness? And when should one disengage with aimless small talk? Banshees poses theses thoughts without a clear conclusion.<br/><br/>Padraic’s (Collin Farrell) hopeless attempts at winning back his friend are just plain depressing. Padraic is stuck between Colm’s (Brendan Gleeson) rejection and Dominic’s (Barry Keoghan) pathetic antics. Colm, the more intellectual of the pair, is tired of wasting away in the pub aimlessly with Padraic. We’re left hoping for Padraic to find peace throughout but he fails to conquer the rejection. I empathize with both Colm and Padraic. We’ve all dealt with rejection as the giver or receiver and this tale brings to mind those occasions in my life. A simple premise beautifully executed.<br/><br/><blockquote>“I’ve changed, I just don’t have a place for dullness in me life anymore”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/9/8/8/8/2/598882-the-banshees-of-inisherin-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-27", 
	"Watched Date": "2021-09-26", 
	"Name": "Dances with Wolves", 
	"Year": "1990", 
	"Rating": "4.5", 
	"Review": "Perfectly paced", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/5/3/9/51539-dances-with-wolves-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-27", 
	"Watched Date": "2015-06-26", 
	"Name": "The Usual Suspects", 
	"Year": "1995", 
	"Rating": "3.5", 
	"Review": "Excellent twist", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/4/9/5/51495-the-usual-suspects-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-01-29", 
	"Watched Date": "2023-01-28", 
	"Name": "Parenthood", 
	"Year": "1989", 
	"Rating": "3.5", 
	"Review": "Call me cliche, but I liked it. Poignant film for a parent-to-be. It makes parenting seem hopelessly exhausting. Attempts of comfort and compassion are met with apathy and agitation. Parenthood is presented as an afflicted journey marked by daily headaches and the fear of trying to do best by your children. It follows three men’s family journeys. Jason Robards, the apathetic, resentful savior. He’s least interested in his children but continues to save and invest in his youngest against better judgement. Rick Moranis, the ‘Einstein prodigy’ cultivator. He’s more focused on his child’s calculus practice than her own creativity. And Steve Martin, the dedicated, loving comforter who encourages his kids more than anything.<br/>Joaquin Phoenix steps up in this earlier film of his. Kid got chops. The whole comedic mass shooting scene (did I stutter?) did not age well and the sound mixing was what you’d expect of a low budget film.<br/>Can’t believe it was set in Kirkwood (filmed in Orlando). Makes me want some Spencer’s Grill. Really enjoyed, especially for an 80s family film.<br/><br/><blockquote>“You know, when I was nineteen, Grandpa took me on a roller coaster. Up, down, up, down. Oh, what a ride! I always wanted to go again. You know, it was just so interesting to me that a ride could make me so frightened, so scared, so sick, so excited, and so thrilled all together! Some didn't like it. They went on the merry-go-round. That just goes around. Nothing. I like the roller coaster. You get more out of it.”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/8g/y5/ne/f5/yHctYQeDL9AcuK79rY1dEgrcPVf-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-02-01", 
	"Watched Date": "2023-01-31", 
	"Name": "The Royal Tenenbaums", 
	"Year": "2001", 
	"Rating": "4", 
	"Review": "Anderson is as consistent to form as anyone. The story is both delightful and melancholic. Witty and dry. The cast is just wonderful too. Each character highlighting their own off-putting, apathetic personality traits.<br/><br/>Gene Hackman stands out as the neglectful, charismatic patriarch. Angelica Huston is amazing as the unaware, concerned and logistical mother. Haven't laughed much harder than when Royal convinces, unconvinces and then re-convinces Etheline he's dying. Then Royal proceeds to intervene himself back into his family’s lives.<br/><br/>Very colorful and playful film.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/sf/k0/qu/5o/5xw30y0pSaMtTcuZW5VaQPiR8qb-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-02-14", 
	"Watched Date": "2023-02-13", 
	"Name": "Black Panther: Wakanda Forever", 
	"Year": "2022", 
	"Rating": "2.5", 
	"Review": "I miss Chadwick Boseman", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/3/5/4/6/0/435460-black-panther-wakanda-forever-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-02-15", 
	"Watched Date": "2023-02-14", 
	"Name": "Your Place or Mine", 
	"Year": "2023", 
	"Rating": "1", 
	"Review": "A cheesier version of<i>The Holiday</i>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/2/6/7/9/5/626795-your-place-or-mine-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-02-16", 
	"Watched Date": "2023-02-15", 
	"Name": "Black Mirror: San Junipero", 
	"Year": "2016", 
	"Rating": "4", 
	"Review": "A Soul touching tale of facing regrets in a era of simulation.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/8/2/6/1/478261-black-mirror-san-junipero-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-02-20", 
	"Watched Date": "2023-02-19", 
	"Name": "Ant-Man and the Wasp: Quantumania", 
	"Year": "2023", 
	"Rating": "2", 
	"Review": "Got better as the film progressed but still just bad. Marvel continues to push cheesy, anti-climactic shiz.<br/><br/>The introduction of Kang was strong initially and ended weak.<br/><br/>Lo found it very predictable.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/6/6/2/3/7/566237-ant-man-and-the-wasp-quantumania-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-06", 
	"Watched Date": "2023-03-05", 
	"Name": "Notting Hill", 
	"Year": "1999", 
	"Rating": "3", 
	"Review": "It's 500 Days of Summer but subtler and takes less creative leaps. Classic '90s drama scene in the bookstore near the end of the film. Best part of the film was Max & Bella's relationship.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/pa/ej/k3/ft/notting-hill-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-09", 
	"Watched Date": "2023-03-08", 
	"Name": "Nocturnal Animals", 
	"Year": "2016", 
	"Rating": "5", 
	"Review": "While a very dark film, Nocturnal Animals is a masterpiece reflecting how one can abstract their torment into an equally dark evil.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/nu/i0/7z/nd/oHL437Dz1TGQMlKfpE6rSQJgMxb-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-10", 
	"Watched Date": "2023-03-09", 
	"Name": "Prisoners", 
	"Year": "2013", 
	"Rating": "5", 
	"Review": "The tone, as supported by the score, is menacing and predatory.The suspense and longing sinks you into a pool of fearful hope.Perfect pace and rhythm.<br/><br/>Holy moly these characters were played soo well. So raw and sinister. Every single one hiding something. The story unravels in an unending recursive spiral of tense madness. There are no plot holes or stranded storylines. Every sequence builds upon the others into a beautiful web of suspicions.<br/><br/>My god 100% recommend to anyone, but prepare for overwhelming evil.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/iw/eg/4g/nm/3w79tTsv6tmlT8Jww6snyPrgVok-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-16", 
	"Watched Date": "2023-03-15", 
	"Name": "Everything Everywhere All at Once", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "What a trip. Gripping, witty and radical. Michelle Yeoh is an all star. The supporting cast decorates this film with wonder and a belief in the absurd. So many parallel paths to keep up with. The mother-daughter connection drives the emotional vein of this film.<br/><br/>More of this please.<br/><br/><blockquote>\"When I choose to see the good side of things, it is not naive. It is strategic and necessary. It is how I've learned to survive through everything\"</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/4/4/7/4/474474-everything-everywhere-all-at-once-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-24", 
	"Watched Date": "2023-03-23", 
	"Name": "Final Destination", 
	"Year": "2000", 
	"Rating": "1.5", 
	"Review": "Uncanny valley meets Jack Ass", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/0/6/8/47068-final-destination-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-26", 
	"Watched Date": "2023-03-25", 
	"Name": "The Matrix", 
	"Year": "1999", 
	"Rating": "3", 
	"Review": "Permeates 90s grunge energy. Feels like Inception, Akira and Fight Club made love with Rage against the Machine and Jiu-Jitsu. Cleary they were low on budget since they reused the Men in Black wardrobe. Not huge on the green filter throughout the film. For today, as in 1999, this is one of the coolest dystopian films besides the abundance of hopeful energy.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/5/1/8/51518-the-matrix-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-03-31", 
	"Watched Date": "2023-03-30", 
	"Name": "RRR", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "This is rebellious and charismatic and unlike anything I've ever seen. <br/><br/>The story is fast-paced and constant. Every moment builds on the last with wonder and intensity. Both Rheem and Ram have a deep purpose which drives all their decisions letting nothing get in the way. The action sequences are untouchable; each one more ridiculous than the last. It is cheesy, has better song/dance than all High School Musicals and includes a flogging scene that rivals The Passion of the Christ.<br/><br/>!!SPOILERS!!: IMO, no way that Palace was laced entirely in TNT near the end.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/0/8/0/3/7/508037-rrr-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-01", 
	"Watched Date": "2011-07-31", 
	"Name": "The Triplets of Belleville", 
	"Year": "2003", 
	"Rating": "3.5", 
	"Review": "I prefer there be more dialogue but the story carries strong without it.<br/><br/>The animation style is an escape from that of Disney or Ghibli; Unique in its own character and sharpness.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/6/9/4/0/46940-the-triplets-of-belleville-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-01", 
	"Watched Date": "2008-03-06", 
	"Name": "Kicking & Screaming", 
	"Year": "2005", 
	"Rating": "5", 
	"Review": "All time most quotable film ", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/6/6/5/9/46659-kicking-screaming-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-01", 
	"Watched Date": "2022-06-17", 
	"Name": "A Knight's Tale", 
	"Year": "2001", 
	"Rating": "3", 
	"Review": "Rock 'n' roll Robin Hood", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/1/2/2/47122-a-knight-s-tale-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-01", 
	"Watched Date": "2021-11-29", 
	"Name": "Uncut Gems", 
	"Year": "2019", 
	"Rating": "3.5", 
	"Review": "Adam Sandler transforms for this role. His performance, the grainy camera and the crystallized soundtrack provoke anxiety and uneasiness.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/0/4/2/6/6/404266-uncut-gems-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-01", 
	"Watched Date": "2023-03-31", 
	"Name": "Pride & Prejudice", 
	"Year": "2005", 
	"Rating": "4", 
	"Review": "It’s like Beauty and the Beast but the Beauty is feistier and the Beast is kind of a bitch<br/><br/>Stacked female cast. Bravo Matthew Macfadyen, I intend to quote his final mystifying monologue daily to my wife; maybe then she’ll kiss me back. I cried when Donald Sutherland cried. The zoom cuts were unexpected but welcome. My spirits were lifted with joy.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/nq/jo/26/tn/dAC0hkYmz5ZOCHURZCyj9isPMPd-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-03", 
	"Watched Date": "2021-12-06", 
	"Name": "When Harry Met Sally...", 
	"Year": "1989", 
	"Rating": "4", 
	"Review": "Great chemistry between Billy and Meg. Their conversations seemed real. I relate to the “wagon wheel coffee table” conflict, but Lauren and I will never split over it... hopefully. Rip Princess Leia and Ms. Ryan.<br/><br/>Guys and girls can’t be friends. They’ll eventually do it or reduce to acquaintances. Unless one of them is gay, then yeah, I guess guys and girls can be friends.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/4/8/5/51485-when-harry-met-sally--0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-07", 
	"Watched Date": "2023-04-06", 
	"Name": "Daisy Jones & the Six", 
	"Year": "2023", 
	"Rating": "3.5", 
	"Review": "Don’t do drugs kids, they make you a selfish prick. Glad there was a happy ending.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/9/8/5/8/1/6/985816-daisy-jones-the-six-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-08", 
	"Watched Date": "2023-04-07", 
	"Name": "Inglourious Basterds", 
	"Year": "2009", 
	"Rating": "5", 
	"Review": "Best opening to a film. Incredible writing.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/1/3/5/2/41352-inglourious-basterds-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-08", 
	"Watched Date": "2021-10-07", 
	"Name": "Dazed and Confused", 
	"Year": "1993", 
	"Rating": "3", 
	"Review": "Coolest opening to a film: <i>Sweet Emotion </i>takes off while aPontiac GTO Judge pulls up with Milla Jovovich in passenger rolling up a joint.Great cast and youthful energy. Great on first watch, very nostalgic.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/7h/zn/l9/ps/2lHRRgoof25kJsLgocf3go2Ccp1-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-09", 
	"Watched Date": "2023-04-08", 
	"Name": "The Super Mario Bros. Movie", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Toad is the perfect wingman. The peach origin story is cute; Lauren thought it similar to Star-Lord’s. The blue star in Bowser’s prison was by far the funniest character in the film. Very cool the way they integrated the original music and sounds of the Mario world. The platformer cinematics gave the game-to-film adaptation a unique feel.<br/><br/>The worst part of the film was Bowser’s love towards Peach. The wedding, the song, the everything. I thought it was horrid. “I’ll marry you just don’t hurt my toads” Lauren thought was funny. I learned from a guy at GameStop that the Mario world is pretty “lore-less”; In the games, Bowser’s mission was never to marry Peach, with the only exception being Super Mario Odyssey (2017).<br/><br/>It started strong but slowly lost its creative strength over time. The supporting characters who were built up early on became forgettable by the end. Story was pretty meh.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/3/2/3/0/2/432302-the-super-mario-bros-movie-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-09", 
	"Watched Date": "2023-04-08", 
	"Name": "Licorice Pizza", 
	"Year": "2021", 
	"Rating": "4", 
	"Review": "Similar to Tarantino’s “Once Upon a Time”, this is PTA’s homage to classic Holllywood. Gorgeous cinema. Gorgeous sound.<br/><br/>Gary Valentine is a daaawwwg who is hatching plans all the time. Alana Kane eager to make something of her self with backwards driving skills that rival Toe Mater.<br/><br/>The side characters were great. Lance: a decorated child actor with a confidence that upstages Gary’s. Jack Holden (Sean Penn): an aged, but revered, actor speaking to others through the lines of his famed characters. Jon Peters (Bradley Cooper): the open-book film producer with an act for being sus.<br/><br/>The camera moves freely with a mind of its own, pivoting its focus with its own priorities. The comedy was subtle yet punchy. I like that PTA chose more vibrant colors than in his previous films; fits the 70s more. John Michael Higgins’ pseudo-Japanese is funny but in guilty way; feels like PTA is one of the few left that even attempts toeing that line.<br/><br/>A lot of my review goes towards the dialogue-heavy sequences between Gary and Alana. The final chase sequence where Alana and Gary run towards each other with subtle nods to previous moments in their relationship was beautifully done.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/4/1/0/8/6/641086-licorice-pizza-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-10", 
	"Watched Date": "2023-04-09", 
	"Name": "The French Dispatch", 
	"Year": "2021", 
	"Rating": "3.5", 
	"Review": "Very pretentious", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/1/2/0/7/471207-the-french-dispatch-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-10", 
	"Watched Date": "2023-04-09", 
	"Name": "The Northman", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "A Nordic mushroom trip revenge tale that is equally barbaric, desperate and savage. Dove deep and stayed true to Nordic mythology in both form and telling.<br/><br/>The DP favored long shots, enhancing the raw nature of the story. “Nine shots contained over 2000 frames with the longest at 3m30s”. I’ll always favor long shots over quick jump cuts commonly found in american action sequences. Long shots help drive the emotion and realness of the action. Complimenting the shot selection was the natural lighting which dominated the film. The ripe green fields covered the day time while warm flames engulfed the colorless night.<br/><br/>Similar demonic, disturbing, gory atmosphere as Midsommar.<br/><br/><blockquote>“A life of death. Yet I swore to survive until this moment. Tomorrow, I shall finish my deeds in honor. Only then will I discover whether living is to my liking.”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/6/5/8/5/2/565852-the-northman-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-11", 
	"Watched Date": "2023-04-10", 
	"Name": "Phantom Thread", 
	"Year": "2017", 
	"Rating": "4", 
	"Review": "Slow, gentle and cold.<br/><br/>Daniel Day Lewis steps up again. Both leads are cold and cunning in their antics. This film moves like a melancholy game of chess between Reynolds and Alma; each move throwing the the next player into critical thought. Reynolds and Alma's age difference shows through their personalities.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/3/5/3/8/4/335384-phantom-thread-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-11", 
	"Watched Date": "2023-04-10", 
	"Name": "Deep Blue Breath", 
	"Year": "2011", 
	"Rating": "5", 
	"Review": "Kid got chops.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/9/0/6/8/9/2/906892-deep-blue-breath-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-12", 
	"Watched Date": "2023-04-11", 
	"Name": "The Truman Show", 
	"Year": "1998", 
	"Rating": "5", 
	"Review": "Jim Carrey like we’ve never seen him before.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/xx/io/jp/45/the-truman-show-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-13", 
	"Watched Date": "2023-04-12", 
	"Name": "Flushed Away", 
	"Year": "2006", 
	"Rating": "2.5", 
	"Review": "Solid story. Stacked cast. Funnier than I remember. Bill Nighy, what an actor. Lots of literal ball busting humor. This was Aardman Animations’ (famous for Chicken Run and Wallace & Gromit) first full CGI flick. Cool to see how the animation style mimicked that of their popular claymation character design.<br/><br/>It was out of touch with reality though, slugs can’t actually sing.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/5/1/3/2/45132-flushed-away-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-14", 
	"Watched Date": "2023-04-13", 
	"Name": "White Chicks", 
	"Year": "2004", 
	"Rating": "1.5", 
	"Review": "Very funny but pretty racist. Definitely didn’t age well. Iconic dance scene. Terry Crews stays supreme though.<br/><br/>The early 2000s film-meta is probably my least favorite. Lotta movies like this came out with mediocre writing, lighting, and a ditsy symphonic soundtrack.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/4/7/5/0/44750-white-chicks-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-16", 
	"Watched Date": "2023-04-15", 
	"Name": "Shark Tale", 
	"Year": "2004", 
	"Rating": "2", 
	"Review": "Finding Nemo destroys this film. De Niro and Scorsese were a great duo in this :)", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/6/1/1/7/46117-shark-tale-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-16", 
	"Watched Date": "2023-04-15", 
	"Name": "Nope", 
	"Year": "2022", 
	"Rating": "4", 
	"Review": "The least scariest horror film I’ve seen. The sound design and score was astounding. You can’t keep your eye off the screen out of fear of missing something.<br/><br/>I love when films include an A-B storyline where B is set in the past and informs key elements of A. In this case, the Gordy story (B) influencing how we perceive Jupe in the present (A). The Gordy story shows how Jupe believes he can tame any predator (and that balloon pops are dangerous). Balloon pop make Gordy go crazy (B) and balloon blew up the UFO (A).<br/><br/>All in all, it was definitely missing <i>something,</i>just not sure what.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/8/2/5/4/7/682547-nope-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-17", 
	"Watched Date": "2023-04-16", 
	"Name": "Jurassic Park", 
	"Year": "1993", 
	"Rating": "5", 
	"Review": "They saved all the good lines for Dr. Malcolm (Jeff Goldblum).<br/><br/>Beautiful combination of horror and adventure. Spielberg melds storytelling and popular horror tropes beautifully.<br/><br/>Lex promotes UNIX, take notes Windows shills.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/1g/zz/ez/d8/yyCKYaW908ZbpexpnBJ3p8o87HA-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-17", 
	"Watched Date": "2023-04-16", 
	"Name": "John Wick", 
	"Year": "2014", 
	"Rating": "3", 
	"Review": "Not a big fan of the blue and yellow filters throughout.<br/><br/>The contemporary rock soundtrack made it feel like a 90s action flick.<br/><br/>Solid action.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/7/2/0/7/6/172076-john-wick-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-22", 
	"Watched Date": "2023-04-21", 
	"Name": "Dungeons & Dragons: Honor Among Thieves", 
	"Year": "2023", 
	"Rating": "3.5", 
	"Review": "That was a fat ass dragon.<br/><br/>Better than I expected. They were able to fit a whole campaign in a little over two hours. Glad this includes animatronics for a lot of the animal-based race characters. Seems like there is a resurgence in animatronics recently. CGI was meh. Tame Impala for the outro tho? Cmon wit it.<br/><br/>“i will not become compliacent in the taking of ill-gotten booty.” Preach.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/2/4/0/0/3/424003-dungeons-dragons-honor-among-thieves-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-25", 
	"Watched Date": "2023-04-24", 
	"Name": "Kiki's Delivery Service", 
	"Year": "1989", 
	"Rating": "3.5", 
	"Review": "Studio Ghibli remains A+ when it comes to female leads. Kiki is inquisitive, independent and focused. <br/><br/>Small details throughout were relatable: When the grandma baked the pie for her granddaughter and then the granddaughter was ungrateful upon delivery. Appreciate your grandparents people! Otherwise, everyone was unreasonably nice - which kinda warmed my heart. <br/><br/>Similar to My Friend Totoro (1988), this is a Ghibli film catered to children; It was a bit boring for my taste due to that. Yet again, few animated films can match Miyazaki-tier style and story.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/5e/rk/0e/99/C70E830B-E641-4CD4-87B3-8DFB91383E20-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-26", 
	"Watched Date": "2023-04-25", 
	"Name": "Beau Is Afraid", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Inventive, sure, it has unique character and feel to it. But wtf did I just watch? I mean… a giant testicle monster?!?? Wtf Ari. A trippy downward spiral of anxiety that confuses reality with the surreal. The border between truth and fiction can’t be less clear. Such a strange ride.<br/><br/>Beau is afraid of his neighborhood, of dying during intercourse and of upsetting his mother.<br/><br/>Beau has deep mommy issues. He is a victim of his mother’s trauma. Accused of crimes he did not commit by a mother who seeks to manipulate and control him.<br/><br/>The opening birth sequence from baby’s POV is terrifying.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/1/5/8/5/6/715856-beau-is-afraid-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-29", 
	"Watched Date": "2023-04-28", 
	"Name": "Along Came Polly", 
	"Year": "2004", 
	"Rating": "3.5", 
	"Review": "A punchy, slap-stick comedy where a bubble-wrapped snowflake collides with a free-spirited nomad. P.S. Hoffman was effing hilarious. The comedic timing throughout was perfecto.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/8/5/3/3/48533-along-came-polly-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-04-30", 
	"Watched Date": "2023-04-29", 
	"Name": "American Hustle", 
	"Year": "2013", 
	"Rating": "3.5", 
	"Review": "The warm colors made the 80s setting come alive. Great soundtrack too; kicking off with some America and Steely Dan. Bale, Adams, Cooper and Lawrence are stand outs for sure. Story was solid; Great twist. Richie (Cooper) is too trigger-happy; easy target for conning.<br/><br/>Carmine’s party was one of my favorite sequences. Complex relationships and conflicting motives intertwine in a tense cacophony of chaos.<br/><br/><blockquote>“She was the Picasso of passive-aggressive karate. She was better than any con artist I ever met including myself. And she had me like nobody had me”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/2/4/3/7/9/124379-american-hustle-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-01", 
	"Watched Date": "2023-04-30", 
	"Name": "The Lego Movie", 
	"Year": "2014", 
	"Rating": "4.5", 
	"Review": "Very rare to see such a solid adaptation with a beautiful story and message. Well done.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/az/2g/rn/wz/7HdNvpAMnU9rjKDJSFzAjnsz0eh-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-01", 
	"Watched Date": "2023-04-30", 
	"Name": "Honey, I Shrunk the Kids", 
	"Year": "1989", 
	"Rating": "2.5", 
	"Review": "Super creative practical set pieces. Ants must be terrified of all the mowing, sprinklers and scorpions in the yard. Love the 90s energy. Rick Moranis has a special place in my heart.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/o2/lq/0g/qi/1R4EWvFjoKCscpGtOeobkTC7BS0-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-05", 
	"Watched Date": "2023-05-04", 
	"Name": "Dune", 
	"Year": "2021", 
	"Rating": "4.5", 
	"Review": "This is a confident, cinematic, risk-taking blockbuster. I hope the Hollywood meta moves in this direction. Simple, yet layered story with beautiful color, articulate sound design and gentle cinematography. Most blockbuster films today move MUCH faster, yet I’m more akin to this quiet-tempered pacing.<br/><br/>With regards to story: I can’t believe how weak Atreides defenses were in the wake of a known impending Harkonnen attack. They knew it was coming and yet act like they had more time!?!?! Idk, Letos lacks some serious awareness. The still-suits looked kinda cheap to me also. It also felt kinda pretentious but was so gorgeous.<br/><br/>This film left me wanting more. Eager for part two this summer.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/nx/8b/vs/gc/cDbNAY0KM84cxXhmj8f0dLWza3t-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-05", 
	"Watched Date": "2023-03-04", 
	"Name": "Chernobyl", 
	"Year": "2019", 
	"Rating": "4.5", 
	"Review": "So that’s how radiation works.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/3/2/0/8/2/532082-chernobyl-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-10", 
	"Watched Date": "2023-05-09", 
	"Name": "Guardians of the Galaxy Vol. 3", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "This is the best delivery from Marvel since End Game. Action-packed from front to back. Very colorful. Very trauma. Very animal abuse. Felt like a scooby doo episode every time the group splits up into their entertaining subgroups.<br/><br/>The ensemble action long shot in the hallway near the end was exactly what this film needed; each character getting to showcase their strengths against several foes while the Beastie Boys blare.<br/><br/>Gotta admit though, pretty fed up with the whole “omg he’s gonna die.. *1 minute later* ..omg he was saved from certain death!”. This happened more than once..<br/><br/><blockquote>“I love you guys” -Groot</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/7/9/7/1/1/379711-guardians-of-the-galaxy-volume-3-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-11", 
	"Watched Date": "2023-05-10", 
	"Name": "Guardians of the Galaxy Vol. 2", 
	"Year": "2017", 
	"Rating": "4", 
	"Review": "James Gunn melds color, music and story so well while keeping a fast tempo. This is a cinematic film with multiple rich plots. Yondu’s story and sacrifice brought emotion. I enjoyed him and Rocket’s relationship. Rocket’s complexity, intellect and brashness make him a staple of the MCU. Mantis and Drax’s chemistry is on point. Baby Groot is the best Groot. Loved the subtle Michelle Yeoh and Ving Rhames appearances near the end.<br/><br/>On first watch, I didn’t like how short, in film time, the story was. It’s basically a day or two. Though after second watch, I didn’t care.<br/><br/><blockquote>“I’m Mary Poppins, y’all!”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/1g/4f/6e/5b/prvWMj8cBFgVn5MLlsjlvH2hiIh-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-11", 
	"Watched Date": "2023-05-10", 
	"Name": "Avengers: Infinity War", 
	"Year": "2018", 
	"Rating": "4.5", 
	"Review": "Every hero entrance and sequence was pivotal to the story. Stakes were high and heroes actually died. What else could you want?", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/2/6/6/6/1/226661-avengers-infinity-war-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-15", 
	"Watched Date": "2023-05-14", 
	"Name": "Spider-Man: Homecoming", 
	"Year": "2017", 
	"Rating": "3", 
	"Review": "Call me cliche but I would’ve been fine with another basic origin story; spider bite and stuff. The kid definitely earned his stripes fair and square. Love Tony and Peter’s relationship<br/><br/>Michael Keaton was awesome. Love Donald Glover. Great appearances from Hannibal Burress and Martin Starr.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/4/2/7/1/0/242710-spider-man-homecoming-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-21", 
	"Watched Date": "2023-05-20", 
	"Name": "GoodFellas", 
	"Year": "1990", 
	"Rating": "4.5", 
	"Review": "The shot when Henry and Karen walk into the club through the back doors on their first date is probably my favorite shot of all time.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/3/8/3/51383-goodfellas-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-24", 
	"Watched Date": "2023-05-23", 
	"Name": "Air", 
	"Year": "2023", 
	"Rating": "3.5", 
	"Review": "The writing was filled with fun facts and foreshadowing one-liners. The soundtrack was great but it was used only for scene transitions. The comedy was fresh and proportioned well. Lil cheesy at times but overwhelmed my expectations.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/6/8/4/9/1/868491-air-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-05-30", 
	"Watched Date": "2023-05-29", 
	"Name": "Invitation to a Murder", 
	"Year": "2023", 
	"Rating": "1.5", 
	"Review": "A cheaper, cheesier British version of Clue. Rolfe from The Office is the butler.. glad he still gets work.  Can’t stand the British daytime TV style lighting.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/9/1/1/9/1/891191-invitation-to-a-murder-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-04", 
	"Watched Date": "2023-06-03", 
	"Name": "Field of Dreams", 
	"Year": "1989", 
	"Rating": "4", 
	"Review": "There is nothing like enjoying a hot dog and soda on the first baseline at Busch Stadium. The smell of peanuts, the crack of the bat and the ambience of the crowd bring peace to mind. This movie reminds us those memories we’ve all had. It is a spiritual journey honoring the history of America’s game. A simple tale executed beautifully; can’t get better than that. My only qualm is that it was shot like a made-for-TV movie.<br/><br/><blockquote>“This field, this game. It’s a part of our past Ray. It reminds us of all that once was good, and it could be again. Oh, people will come Ray. People will most definitely come.”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/sk/d9/0x/hm/uYpaC4TFH7sDtvfK8ANlWMKhmHv-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-15", 
	"Watched Date": "2023-06-14", 
	"Name": "Spider-Man: Across the Spider-Verse", 
	"Year": "2023", 
	"Rating": "4.5", 
	"Review": "Artistry at its peak. Boundary pushing. Different art forms coexist beautifully. It feels more like an art gallery than a superhero flick. Spot was by far my favorite character design; as the film progresses, Spot becomes more power-hungry and mad. In parallel with his arc, his visual portrayal becomes less realistic, more scattered and abstract.<br/><br/>The story is the collision of all things Spider-Man. Executes the multiverse concept way more effectively than its live action counterparts, like Spider-Man: No Way Home. Andy Samberg as Scarlet Spider and Daniel Kaluuya as Spider-Punk brought the comedic vibes this film needed.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/9/7/6/3/1/497631-spider-man-across-the-spider-verse-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-02-15", 
	"Name": "Twilight", 
	"Year": "2008", 
	"Rating": "0.5", 
	"Review": "Trash", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/7/4/6/9/47469-twilight-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-02-15", 
	"Name": "The Twilight Saga: New Moon", 
	"Year": "2009", 
	"Rating": "0.5", 
	"Review": "🗑️", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/0/4/8/0/40480-the-twilight-saga-new-moon-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-02-15", 
	"Name": "The Twilight Saga: Eclipse", 
	"Year": "2010", 
	"Rating": "0.5", 
	"Review": "Actual trash", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/7/0/8/8/37088-the-twilight-saga-eclipse-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-02-15", 
	"Name": "The Twilight Saga: Breaking Dawn – Part 1", 
	"Year": "2011", 
	"Rating": "0.5", 
	"Review": "Dumpster doo doo", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/5/0/7/7/15077-the-twilight-saga-breaking-dawn-part-1-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-02-15", 
	"Name": "The Twilight Saga: Breaking Dawn – Part 2", 
	"Year": "2012", 
	"Rating": "0.5", 
	"Review": "Honest opinions only: trash", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/5/0/7/6/15076-the-twilight-saga-breaking-dawn-part-2-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-16", 
	"Watched Date": "2023-06-15", 
	"Name": "10 Things I Hate About You", 
	"Year": "1999", 
	"Rating": "3.5", 
	"Review": "I love Seattle. JGL is spectacular", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/hl/jj/br/9g/Kd5OkBc6GyUa1tIpxYUHLpyE2t-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-17", 
	"Watched Date": "2023-06-16", 
	"Name": "Knock at the Cabin", 
	"Year": "2023", 
	"Rating": "2.5", 
	"Review": "Apocalypse (is) now. Subpar dialogue. Didn’t like the frequent use of off-kilter shots. I doubted until the end.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/5/8/0/5/6/558056-knock-at-the-cabin-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-20", 
	"Watched Date": "2023-06-19", 
	"Name": "Black Mirror: Joan Is Awful", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Nice twist", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/b7/td/72/qr/BlackMirror-JoanIsAwful_2-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-20", 
	"Watched Date": "2023-06-19", 
	"Name": "Black Mirror: Loch Henry", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "That boy ain’t recovering anytime soon.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/y9/q2/qk/ci/BlackMirror-LochHenry_2-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-21", 
	"Watched Date": "2023-06-20", 
	"Name": "Black Mirror: Beyond the Sea", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Gently menacing but felt like something was missing", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/zt/6s/r6/pr/BlackMirror-BeyondTheSea_2-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-22", 
	"Watched Date": "2023-06-21", 
	"Name": "Booksmart", 
	"Year": "2019", 
	"Rating": "3.5", 
	"Review": "Very funny and very woke. Loved the energy and chemistry between all characters, especially Molly and Amy.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/3/5/4/5/0/435450-booksmart-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-23", 
	"Watched Date": "2023-06-22", 
	"Name": "Charlie's Angels", 
	"Year": "2019", 
	"Rating": "1.5", 
	"Review": "A cheap reboot", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/9/0/6/5/2/390652-charlie-s-angels-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-06-28", 
	"Watched Date": "2023-06-27", 
	"Name": "The Departed", 
	"Year": "2006", 
	"Rating": "4.5", 
	"Review": "The narrative plays out like a symphony; doesn’t miss a beat and is constantly barreling forward. A movie’s quality is in it’s re-watchability and The Departed is always enjoyable on return. The final shot is *french kiss*, so poetic.<br/><br/><blockquote>How’s your mother?<br/><i><b>Ahh she’s on her way out</b></i><br/>we all are. Act accordingly.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/jr/th/pu/pb/laefkgrfa3oKwvBtWTBtf2suiI4-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-01", 
	"Watched Date": "2023-06-30", 
	"Name": "Run Rabbit Run", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "It’s Birdemic but with bunnies. When childhood trauma parallels with adult life, a spiral of terror is formed.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/3/7/8/6/0/637860-run-rabbit-run-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-07", 
	"Watched Date": "2023-07-06", 
	"Name": "Asteroid City", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "\"You can't wake up if you don't fall asleep\" :confused-face:<br/><br/><blockquote>Do you dare me… to climb that cactus?</blockquote>Per usual with Wes - the colors, set design and cinematography meld into a beautiful painting. The soundtrack is delightful, endearing and inquisitive. The three Steenbeck girls are an outstanding ensemble as with the other child actors; I could watch Woodrow Steenbeck in his own mini-series ten times over.<br/><br/>Most of Wes Anderson's films favor style over substance. Here, however, he makes a meta, wall-bending commentary on acting which (sort of) states: play on, even when the purpose is lost. This vibe is felt throughout. The story is meh in \"Asteroid City\" but multi-dimensional in the \"execution of the play of Asteroid City\".<br/><br/>Anderson held my attention (and my heart) most in one of the final sequences: In his search for purpose, Jones Hall (Augie / Jason Schwartzman) runs into Margot Robbie's character, who narrates the most heart-wrenching scene from the play's script (although it was cut from the play); something about mamas talking from the dead just gets me.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/6/8/5/5/5/668555-asteroid-city-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-09", 
	"Watched Date": "2023-07-08", 
	"Name": "Bird Box", 
	"Year": "2018", 
	"Rating": "2.5", 
	"Review": "Subpar acting. Should’ve been more scary for a Jaws wannabe", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/4/0/2/0/2/340202-bird-box-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-09", 
	"Watched Date": "2023-07-08", 
	"Name": "Legends of the Fall", 
	"Year": "1994", 
	"Rating": "4.5", 
	"Review": "Samuel wouldn’t change for her,Alfred barely had herand Tristan let her get away.A tragic timepiece in the most exquisite setting. Beautifully written, performed and shot.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/nj/ai/hd/ey/uh0sJcx3SLtclJSuKAXl6Tt6AV0-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-10", 
	"Watched Date": "2023-07-09", 
	"Name": "Dunkirk", 
	"Year": "2017", 
	"Rating": "5", 
	"Review": "A narrative masterpiece built on practicality and beauty.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/md/nb/pu/3i/bOXBV303Fgkzn2K4FeKDc0O31q4-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-11", 
	"Watched Date": "2023-07-10", 
	"Name": "Once Upon a Time… in Hollywood", 
	"Year": "2019", 
	"Rating": "3.5", 
	"Review": "Moves like a classic from the Golden age of Hollywood. Great cast. Brad Pitt murders.. metaphorically and literally. We should all strive to be more like Cliff.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/9/7/8/5/9/397859-once-upon-a-time-in-hollywood-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-11", 
	"Watched Date": "2023-07-10", 
	"Name": "It Follows", 
	"Year": "2014", 
	"Rating": "3.5", 
	"Review": "Very stressful watch. Love the heavy use of zoom cuts and pans; very indie.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/zr/lv/9v/wy/4MrwJZr0R9LbyOgZqwLNmtzzxbu-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-12", 
	"Watched Date": "2023-07-11", 
	"Name": "Heat", 
	"Year": "1995", 
	"Rating": "5", 
	"Review": "Gripping, clever, sharp, electric and visually stunning.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/9/9/4/51994-heat-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-14", 
	"Watched Date": "2023-07-13", 
	"Name": "Minority Report", 
	"Year": "2002", 
	"Rating": "3.5", 
	"Review": "A forgotten dystopian classic", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/1o/qh/5e/ur/dS5AHLt4DhZpisxryIxKJU6Urxb-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-14", 
	"Watched Date": "2023-07-14", 
	"Name": "Fantastic Mr. Fox", 
	"Year": "2009", 
	"Rating": "4.5", 
	"Review": "Wholesome, witty and therapeutic. A buddy of mine said this cured his depression.. I can see why.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/6/3/4/4/46344-fantastic-mr-fox-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-15", 
	"Watched Date": "2023-07-14", 
	"Name": "Inglourious Basterds", 
	"Year": "2009", 
	"Rating": "4.5", 
	"Review": "A master class in dialogue. Similar to OUATIH, Tarantino rewrites history with a knack for retribution.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/1/3/5/2/41352-inglourious-basterds-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-21", 
	"Watched Date": "2023-07-20", 
	"Name": "Barbie", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "Feminism and Patriarchy clash in a comical but dramatic mix. It’s The LEGO Movie meets The Matrix meets Grease meets Legally Blonde. The soundtrack takes the film to another level.<br/><br/>Barbie loses her innocence and rewrites her destiny. Ken becomes corrupted and is subsequently rescued by Barbie from patriarchical turmoil. Man needs woman.<br/><br/>The only lackluster sequences were those in the real world; they gave off a cheaper, studio-pumped blockbuster feel compared to the Dreamland sequences (gd product placement!). The wardrobe, set design and color filtering was awesome and absurd; GG continues to dazzle.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/7/7/0/6/4/277064-barbie-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-27", 
	"Watched Date": "2022-11-25", 
	"Name": "Hell or High Water", 
	"Year": "2016", 
	"Rating": "4", 
	"Review": "Very funny. Ben Foster is fantastic.<br/><blockquote>Boy, You'd think there were ten of me.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/os/sk/tr/0a/6YOrNBdoXvT8aC5VPLkkN6t5z0V-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-29", 
	"Watched Date": "2023-07-28", 
	"Name": "Oppenheimer", 
	"Year": "2023", 
	"Rating": "5", 
	"Review": "His duty to the nation called for the destruction of the world. His masterpiece became his triumph and downfall. The politicians who sought his expertise would eventually discredit him into oblivion. Oppenheimer was a conflicted man of questionable ambition at times; and he never found peace after becoming an American Prometheus.<br/><br/>Nolan delivers a narrative triumph. In Nolan fashion, the story jumps across time to emphasize pivotal moments in Oppenheimer’s race to the A-bomb and the turmoil that followed. The 3h epic moves swiftly in rhythm to a growling and momentous score. The sound design saturates the ears; providing a look into Oppenheimer’s tormented mind as he grapples with the weight of his actions. During his “victory speech” in Los Alamos, Oppenheimer stares into the void while booms and screams echo. Nolan relies on match cuts at various points in the film to indicate Oppenheimer’s guilt and fear. Shots of Murphy are matched with shots of rain hitting the water and missile wakes in the clouds; symbolizing the A-bomb and its potential wake of destruction; indicating what Oppenheimer feared most.<br/><br/>I take my hat off to Murphy, RDJ and, especially, Emily Blunt; stellar performances.<br/><br/><blockquote>“Don’t take in the sheets”</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/8/4/3/2/8/784328-oppenheimer-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-30", 
	"Watched Date": "2023-03-29", 
	"Name": "The Shawshank Redemption", 
	"Year": "1994", 
	"Rating": "4", 
	"Review": "Patient, self-avenging and emotionally moving", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/7l/hn/46/uz/zGINvGjdlO6TJRu9wESQvWlOKVT-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-30", 
	"Watched Date": "2022-09-29", 
	"Name": "The Mummy", 
	"Year": "1999", 
	"Rating": "3.5", 
	"Review": "The revamped Indiana Jones adventure I crave", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/5i/du/2g/s8/6CweTLmngcPrsEH4G6RKvdwmQdC-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-30", 
	"Watched Date": "2023-07-29", 
	"Name": "The Prestige", 
	"Year": "2006", 
	"Rating": "4", 
	"Review": "Obsession can drive a human to do the unimaginable; while the spectacle is magical, the truth behind it is corrosive. Borden’s ambition was his blind spot and Angier’s competitive spirit his. The rivalry between Borden and Angier is subtly paralleled by the war between electricity magnates, Edison and Tesla; this reference provides a sense of magnitude for the feud between London’s top magicians. The power dynamic between Borden and Angier sways throughout. When it seems Borden has defeated Angier with wit and mystery, Angier’s will prevails, but not without a cost.<br/><br/>Although predictable, Nolan’s ability to reveal and hide elements throughout the story evokes a sense of discovery and amazement as a viewer; much like an experience at Houdini’s theater. Nolan’s signature warped time format encourages this sense of discovery by peeling back truths about our protagonists over time. The magic is real when kept in secret. Seeking the truth only produces madness. Bale and Jackman executed this fictional rivalry with grit and veracity.<br/><br/><blockquote>Obsession is a young man’s game. I can’t follow you any further in it.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/1/4/7/51147-the-prestige-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-31", 
	"Watched Date": "2023-01-19", 
	"Name": "Zero Dark Thirty", 
	"Year": "2012", 
	"Rating": "4.5", 
	"Review": "Calm, menacing and calculated in a chaotic, abusive and unapologetic environment. Chastain and Bigelow are a perfect quarterback/coach duo.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/0/3/4/9/80349-zero-dark-thirty-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-07-31", 
	"Watched Date": "2023-07-30", 
	"Name": "Interstellar", 
	"Year": "2014", 
	"Rating": "5", 
	"Review": "This has all the landmarks of a classic western: The gravitas lines, the seasoned cowboy and a call to adventure. <br/><br/>The conflict between continuity and displacement propels the film's inquisitive edge; someone placed the wormhole, someone pushed the book and someone created the apparatus by which Cooper communicated with Murphy. The search for 'how' forces the audience to ponder on humanity’s next evolution. The cadence is patient and momentous, fueled by the powerhouse score which echoes courage and hope. Beyond the score, the sound design articulates the empty yet terrifying nature of space.<br/><br/>The documentary interviews from survivors of the 1930s dust bowl is a great touch. The planet design is incredible too: Dr. Miller’s planet having 130% more gravity than earth as justified by the mountain-like waves. Dr. Mann's is isolated and barren as personified by the cold atmosphere and distanced location.<br/><br/>Nolan's cinematography and practical effects make for a timeless classic in the final frontier. McConaughey kills it as the brave cowboy alongside several other moving performances.<br/><br/><blockquote>After you kids came along, your mother said something I didn't really understand - she said, \"I look at the babies and I see myself as they'll remember me.' she said, \"It's as if we don't exist anymore, like we're ghosts, like now we're just there to be memories for our kids.' Now I realize - once we're parents, we're just the ghosts of our childrens' futures. I can’t be your ghost right now.</blockquote><blockquote><i>Cooper, there’s no point using our fuel to -</i><br/><b>Just analyze the Endurance’s spin -</b><br/><i>What’re you doing?!</i><br/><b>Docking. Get ready to match it on the retro-thrusters -</b><br/><i>It’s not possible -</i><br/><b>No. It’s necessary.</b></blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/1/7/6/2/1/117621-interstellar-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-01", 
	"Watched Date": "2022-06-04", 
	"Name": "The One I Love", 
	"Year": "2014", 
	"Rating": "3", 
	"Review": "A solid Black Mirror episode", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/br/3b/1o/fe/uXOZsGmyPgNGsru9QwLVXmYJ9Pg-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-02", 
	"Watched Date": "2023-08-01", 
	"Name": "Babylon", 
	"Year": "2022", 
	"Rating": "2.5", 
	"Review": "Goodbye Norma Jean. Similar to Tarantino’s OUATIH and PTA’s Licorice Pizza, this is Chazelle’s love letter to Hollywood; I guess La La Land was too but whatever. Babylon is unadulterated chaos and comedy cataloging the rise of talkies and fall of silent films in Hollywood. The cinematography and shot selection are very appealing to the eyes. 35mm is fuego.<br/><br/>While it looked beautiful, I couldn’t get behind the story. Babylon gives multiple perspective on the rise and fall of entertainment industry types. I never felt emotionally involved or intrigued by their stories, just felt like I was along for the ride. The story took tangents that didn’t satisfy the overarching narrative; felt like a Pulp Fiction wannabe. I do love time pieces though and it seems we don’t get many films from this time and place; an exception being Chaplin. I wish they played more into the romance between Manny and Nellie because it wasn’t palpable enough. Could’ve been executed more poetically. Even then, Margot Robbie and Diego Calva are outstanding and l got a kick out of Spike Jonze’s small part.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/4/2/7/7/3/542773-babylon-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-05", 
	"Watched Date": "2023-08-05", 
	"Name": "Oppenheimer", 
	"Year": "2023", 
	"Rating": "5", 
	"Review": "This is the most cohesive, fast paced 3h film I’ve seen; which is complimented by the hurried score. The film churns forward at full speed like a locomotive without brakes. Nolan barely gives the viewer a moment to breathe. He exquisitely paints Oppenheimer’s various conflicting states of mind. Pre-war Oppy was confident, witty and inquisitive. Post-war Oppy was burdened by guilt and fear, making him an easy target for those preying on his downfall.This time around I was rocked by the emotional pull of the film and the constant shaking of the theater.<br/><br/>The Only real flaw for me was some cheesy quips, executed primarily by Damon. These lines were meant to relieve tension or be momentous but ended up leaving a sour taste in their sequences.<br/><br/>1. Fission (polychrome). Atoms split. Ends with both Oppenheimer’s clearance denial and his nuclear chain reaction nightmare. Chaos grows, order splits apart and the future is unpredictable.<br/><br/>2. Fusion (monochrome). Atoms combine. Ends with the fall of Strauss at the hands of Hill’s enlightening testimony. Truth comes together, a resolution is found.<br/><br/><blockquote>Nobody knows what you believe. Do you?</blockquote><blockquote>Can you hear the music, Robert?</blockquote><blockquote>You can’t lift the stone without being ready for the snake that’s revealed.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/8/4/3/2/8/784328-oppenheimer-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-07", 
	"Watched Date": "2023-06-06", 
	"Name": "Ocean's Eleven", 
	"Year": "2001", 
	"Rating": "4", 
	"Review": "The zooms! Cinematography gold", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/cq/zv/tn/d6/5ZfdSZeP4ZDJwA3Q17SpxV6wBjF-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-07", 
	"Watched Date": "2023-08-06", 
	"Name": "Se7en", 
	"Year": "1995", 
	"Rating": "3", 
	"Review": "This isKeyser Soze’s last act. Ithas all the 90s punk-noir I was hoping for. The climax was v predictable.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/3/4/5/51345-se7en-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-07", 
	"Watched Date": "2023-08-04", 
	"Name": "W.", 
	"Year": "2008", 
	"Rating": "2.5", 
	"Review": "Stone's strategic mix of timelines enhances the storytelling, allowing us to witness W's journey and unyielding personality more vividly.<br/><br/>Stone’s commentary on Bush is clear in several sequences paired with a soundtrack. The war room shot with Bush in center frame and a halo-like light above his head, gives the feeling that his execution of the war is somehow destined by a higher power. The following shots are footage of Iraq being blown to bits while the <i>Yellow Rose of Texas</i> plays. Another war room scene features an acoustic version of <i>Battle Hymn of the Republic</i> during a discussion on going to war with Iran for freedom, which cleverly highlights the underlying motivations of oil interests. In another sequence, circus music plays while Bush faces reporters, adding a touch of satire to his policy struggles.<br/><br/>Thandie Newton's portrayal of Condoleezza Rice is impeccable, adding depth to the character. The film also captures the essence of Bush's personality through well-crafted Bushisms, providing a glimpse into his unwavering and anointed narcissism.<br/><br/>Though the baseball field sequences were somewhat forgettable, the final scene stands out. As a pop fly never lands, it symbolizes Bush's pursuit of personal victory but his ultimate failure to achieve it. This poignant moment encapsulates the film's exploration of Bush's complexities and the challenges he faced during his presidency.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/pe/er/fj/m0/upFQuRzN23kLvzO1brSFClLqZvV-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-08", 
	"Watched Date": "2020-06-07", 
	"Name": "Detroit", 
	"Year": "2017", 
	"Rating": "2.5", 
	"Review": "Brutal. Hard to watch", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/4/1/7/5/4/341754-detroit-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-12", 
	"Watched Date": "2023-08-11", 
	"Name": "Asteroid City", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Margot Robbie’s scene is the best scene. Woodrow is my spirit animal; I hope to have a son just like him some day. Seldom does a director create a film solely to comment on his own style. Meta.<br/><br/><blockquote>I don’t understand the play. Am I doing it right?<br/><b>It doesn’t matter just keep telling the story.</b></blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/6/8/5/5/5/668555-asteroid-city-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-16", 
	"Watched Date": "2023-08-15", 
	"Name": "Drive", 
	"Year": "2011", 
	"Rating": "3.5", 
	"Review": "Gosling plays the stoic outlaw in this synthy, 80s-inspired vigilante flick. He is a protective grease monkey with immense sad boy energy. His capacity for chaos is by far his most compelling trait; as he gets deeply entangled with his neighbors, he becomes more willing to do whatever it takes to save them. The cinematics and sound design give me <i>It Follows (2014)</i> vibes; maybe it’s just the indie aesthetic.<br/><br/>Who knew Marlin (Finding Nemo) could be this soulless?", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/6d/6l/r3/e9/nu7XIa67cXc2t7frXCE5voXUJcN.jpg-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-17", 
	"Watched Date": "2023-08-16", 
	"Name": "Arrival", 
	"Year": "2016", 
	"Rating": "4", 
	"Review": "What a beautiful thesis on linguistics. Although some moments make it seem like interspecies communication is easy, this conceptualization of alien correspondence is intriguing and thought provoking.  For those who did not study linguistics, like myself, this was a unique essay on the subject.<br/><br/>The cynically-minded military is pitted against the intellectual optimism of Dr. Banks (Adams) and Donnelly (Renner). The conflicting perspectives produce chaos in the already distressed and unassured situation. Soldiers at the camp are influenced by scared family members and conspiracy theorists. Country figure heads act out in fear and gatekeep their findings from others. The CIA is convinced an offensive attack must be prepared. All of these motives clash with the progress Banks and Donnelly are achieving, climaxing in a “timeless” opportunity to save the planet from its own inhabitants.<br/><br/>With regards to the cinematography, Denis is known for using color filtering as a narrative tool; and here it provides temporal context. Certain sequences are coated by red and sunny filtering, which, as you come to find, denotes an auxiliary timeline. In addition, I love his use of wide angle and large environment shots. Denis murders all films I’ve seen of his so far, eager for more.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/3u/dy/qd/qd/4Iu5f2nv7huqvuYkmZvSPOtbFjs-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-23", 
	"Watched Date": "2023-08-22", 
	"Name": "Beautiful Boy", 
	"Year": "2010", 
	"Rating": "3", 
	"Review": "The subject matter alone was enough to pull me in: parents on the brink of divorce must face the consequences of their son’s mass murder and suicide. The expected deeply scarring emotional beats pay off and give an intimate look into the lives  of this publicly-shamed parental archetype.<br/><br/>Regarding cinematics, I can’t stand steadicam cinematography but I guess it enhances the themes of chaotic desolation, guilt and loneliness. The uncomfortably close shots produce unwanted claustrophobia too.<br/><br/>I can’t get the atrocious John Lennon song of the same name out of my head now.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/9/4/4/6944-beautiful-boy-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-25", 
	"Watched Date": "2023-08-24", 
	"Name": "mid90s", 
	"Year": "2018", 
	"Rating": "4", 
	"Review": "Jonah Hill captures the same child-like aimlessness and brashness of \"The Florida Project,\" but in a grimy, hip-hop-infused style on 16mm. The instrumental score is somber and gentle, which clashes with the boombap 90s hip-hop soundtrack. A solid mix of soft vibes and hard jams enhances the portrayal of an insecure latchkey kid’s lifestyle.<br/><br/>You can’t help but sympathize with every character; each is fraught with their own demons, which are exacerbated by their impoverished lifestyles. For some, these demons embody weakness as power dynamics shift over the course of the film. Take Stevie’s brother, Ian, and Ruben: both overpower Stevie physically and mentally, but lose their grip on their (mental) power as Stevie takes more risks and scales the social hierarchy. Although Ian abuses Stevie throughout, I can’t help but ache when we see how truly lonely Ian is. Lucas Hedges nailed that role.<br/><br/>In many ways, this reminded me of my childhood. I wasn’t a skater, I wasn’t a big risk-taker, and I wasn’t physically abused. But, like many kids, I wanted to belong but wasn't sure how to be. I had low expectations for this film but was surprised by it’s raw authenticity. With a decent cast of young nobodies (sorry), Jonah Hill seems to capture this essence well.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/7/0/4/5/1/370451-mid90s-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-30", 
	"Watched Date": "2023-08-29", 
	"Name": "The Great Mouse Detective", 
	"Year": "1986", 
	"Rating": "3", 
	"Review": "Fidget is straight out of a horror film.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/6/6/4/7/46647-the-great-mouse-detective-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-31", 
	"Watched Date": "2023-08-30", 
	"Name": "Office Space", 
	"Year": "1999", 
	"Rating": "3", 
	"Review": "I laughed because it’s true; the feelings, the attitudes and the discontent. Software is to the corporate world what rap is to the music industry… clearly. Funny with a great soundtrack but shot in a plain style. Michael Bolton is clearly a second cousin of Dwight Schrute.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/0/9/9/1/50991-office-space-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-08-31", 
	"Watched Date": "2023-08-30", 
	"Name": "Fargo", 
	"Year": "1996", 
	"Rating": "3.5", 
	"Review": "Violent yet dry, gentle and unassuming. Several long shots paired with little noise, mostly of moving cars, are trickled throughout which produces a sense of calm amidst the murderings. Was it worth it? Well oh yeah, sure, you’re darn tootin’ it was.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/7/8/1/51781-fargo-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-05", 
	"Watched Date": "2023-09-04", 
	"Name": "Hereditary", 
	"Year": "2018", 
	"Rating": "4", 
	"Review": "Stunning film. Stand out performance from Toni Collette. Only the death of a child can fuel this kind of insanity and blind vulnerability. I guess Charlie is a boy’s name after all…", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/2/4/3/4/8/424348-hereditary-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-07", 
	"Watched Date": "2023-09-06", 
	"Name": "Hacksaw Ridge", 
	"Year": "2016", 
	"Rating": "2.5", 
	"Review": "Packed with emotionally charged, life-defining moments; more like a Hallmark film and less like a biopic. Cheap lines, theatrics and explosions. Doss kicking the grenade… c’mon man. The focus on dread, death and destruction certainly emphasizes Doss’s opposing convictions. This is a beautiful, God-centered inspiring story told in a lazy way.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/5/1/8/7/2/251872-hacksaw-ridge-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-13", 
	"Watched Date": "2023-09-12", 
	"Name": "Spirited Away", 
	"Year": "2001", 
	"Rating": "4.5", 
	"Review": "The story is as deep as you let it be. Only a child-like spirit and determination can overcome the sins of greed.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/9/2/1/51921-spirited-away-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-16", 
	"Watched Date": "2023-09-15", 
	"Name": "Kelce", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "Felt artificially dramatized at certain moments but, still, an intimate, fresh perspective. Around the corner, Kelce sees retirement and the emptiness that comes with it. His ending monologue on the couch has him asking the core question of the doc: “How can I walk away from my greatest passion?” Jason responds by choosing to seize the day while he still can; which ignites the audience to do the same.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/0/5/6/2/1/0/1056210-kelce-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-19", 
	"Watched Date": "2023-09-17", 
	"Name": "Ghostbusters", 
	"Year": "1984", 
	"Rating": "2.5", 
	"Review": "Childhood favorite. Bill Murray is hilarious, pretentious and suave.<br/><br/><blockquote>I’m gonna go for broke. I am madly in love with you</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/1/6/6/6166-ghostbusters-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-21", 
	"Watched Date": "2023-09-20", 
	"Name": "Father of the Bride", 
	"Year": "1991", 
	"Rating": "2.5", 
	"Review": "It has it’s moments. Made me cry. The look Annie gives him when she walks down the aisle.. tear jerker. When she calls him from the airport… waterfalls. My future self empathizes with George Banks.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/4/9/5/6/44956-father-of-the-bride-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-09-25", 
	"Watched Date": "2023-09-24", 
	"Name": "Past Lives", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "Gentle and honest. A heart breaking tale of drifting apart, slipping away and leaving behind. Beautifully shot, sequenced and colored. The slow pace allows you to reel in the subtle intentions of Nora and Hae Sung’s interactions. Hae Sung searches for the life they’ve yet to live, while Nora’s attempts at reminiscing only suffocate his hopes. Leaves you pondering the question, “what if?”<br/><br/><blockquote>If you leave something behind, you gain something too.</blockquote><blockquote>It’s like planting two trees in one pot. Our roots need to find their place.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/9/1/0/5/3/591053-past-lives-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-02", 
	"Watched Date": "2023-10-01", 
	"Name": "The Big Short", 
	"Year": "2015", 
	"Rating": "4.5", 
	"Review": "An intimate yet chaotic exposure to the greed-fueled downfall of our economy. Carrell brings the emotional vitriol, Bale brings the unexpressive practicality, and Gosling brings the charisma. McKay acts as both an educator and a judge, constantly breaking the fourth wall to keep the audience up to speed while delivering a scathing review of the corrupt financial system. The story structure and performances throughout leave the audience with mixed emotions: anger toward the greedy, sympathy for the innocent, and conflicted feelings toward those who saw it all coming.<br/><br/><blockquote>I don’t get it. Why are they confessing?<br/><i>They’re not confessing. They’re bragging.</i></blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/4/6/0/1/3/246013-the-big-short-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-08", 
	"Watched Date": "2023-10-07", 
	"Name": "Prisoners", 
	"Year": "2013", 
	"Rating": "5", 
	"Review": "This makes your stomach drop and your heart beat in the most cinematically gorgeous way.<blockquote>Make sure they cremate me; I don't want to be buried in some box.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/iw/eg/4g/nm/3w79tTsv6tmlT8Jww6snyPrgVok-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-25", 
	"Watched Date": "2023-10-20", 
	"Name": "The Wonderful Story of Henry Sugar", 
	"Year": "2023", 
	"Rating": "3", 
	"Review": "A recursive pit of cathartic narration. The acting forces the audience to participate. Anderson theater-esc sets provoke a feeling of organic ingenuity. Writing felt a bit pretentious.. like my reviews.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/2/9/3/6/4/829364-the-wonderful-story-of-henry-sugar-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-28", 
	"Watched Date": "2023-10-27", 
	"Name": "Shane Gillis: Beautiful Dogs", 
	"Year": "2023", 
	"Rating": "3.5", 
	"Review": "His demeanor and execution was frat level chill but his sexual jokes were frat level frequency.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/0/5/6/1/1/6/1056116-shane-gillis-beautiful-dogs-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-28", 
	"Watched Date": "2023-10-27", 
	"Name": "Ex Machina", 
	"Year": "2015", 
	"Rating": "3.5", 
	"Review": "Very few surprises. Stayed simple. Nathan and Caleb were locked into their archetypes throughout, unchanging. Ava was the star. When she put on the dress for the first time I about wept.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/8/7/9/8/6/187986-ex-machina-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-29", 
	"Watched Date": "2023-10-28", 
	"Name": "When a Stranger Calls", 
	"Year": "1979", 
	"Rating": "2", 
	"Review": "The first act is great horror: The hallway shots and empty rooms, the soft tone and the music all enhance the fear of the faceless voice. The rest of the film sucked.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/1/9/3/3/0/19330-when-a-stranger-calls-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-10-30", 
	"Watched Date": "2023-10-29", 
	"Name": "The Texas Chain Saw Massacre", 
	"Year": "1974", 
	"Rating": "1.5", 
	"Review": "Some 14yo hippie took his parent’s film camera and decided to make the most uncomfortable, story-deprived film anyone’s ever seen. This is the result.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/1/9/8/5/31985-the-texas-chain-saw-massacre-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-04", 
	"Watched Date": "2023-11-03", 
	"Name": "Halloween", 
	"Year": "1978", 
	"Rating": "3.5", 
	"Review": "Prettiest suburban set goes to Haddonfield, IL. Shot selection and framing were exceptional; no wonder Dean Cundey went on to DP several other classics. It was real haunting seeing Myers constantly in the background staring at his eventual victims. Great horror.<br/><br/><blockquote>Death has come to your little town, sheriff. You can either ignore it or help me stop it.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/0/2/9/8/60298-halloween-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-09", 
	"Watched Date": "2023-11-08", 
	"Name": "Beetlejuice", 
	"Year": "1988", 
	"Rating": "3.5", 
	"Review": "What an acid trip of a film. Michael Keaton was unrecognizable on all fronts. Beetlejuice is a menace, dropping F-bombs in PG movies…", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/rs/wk/3i/nt/gWnW7vxm8yr01TVLQhL4aI02orp-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-13", 
	"Watched Date": "2023-11-12", 
	"Name": "Days of Heaven", 
	"Year": "1978", 
	"Rating": "3", 
	"Review": "An intimate view of early-20th century life on the prairie lands. You’re either the rich or the worker. The majority are just trying to get by and willing to con to climb the economic ladder.<br/><br/>Cinematically gorgeous; such a beautiful landscape. All other aspects were subpar; Sound design was terrible. The story should carry the film and this one had some strong moments but drudged on significantly without intention.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/x3/jx/v5/l2/rwxTYjOZmX2rGhz7avLe1qsjNqe-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-18", 
	"Watched Date": "2023-11-17", 
	"Name": "Mission: Impossible III", 
	"Year": "2006", 
	"Rating": "2.5", 
	"Review": "Great transitions. Wasted no time and we got to travel to US then Berlin then US then Italy then US then China then US then honeymoon.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/2/0/4/51204-mission-impossible-iii-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-19", 
	"Watched Date": "2021-12-18", 
	"Name": "West Side Story", 
	"Year": "2021", 
	"Rating": "4", 
	"Review": "A beautiful homage with it’s own personality.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/yd/j5/tz/up/xW3t04p24jH7aQyq1J63ApAP9gG-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-11-25", 
	"Watched Date": "2023-11-24", 
	"Name": "The Killer", 
	"Year": "2023", 
	"Rating": "2.5", 
	"Review": "The Killer’s meticulous, OCD antics are calculated and emotionless yet cathartic for viewers. Otherwise, this was just ad placement mania. Overall bland", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/1/7/6/5/4/717654-the-killer-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-15", 
	"Watched Date": "2023-12-14", 
	"Name": "The Mummy", 
	"Year": "1999", 
	"Rating": "3", 
	"Review": "The era of atrocious CGI. Discount Indiana Jones thru and thru… still love it though", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/5i/du/2g/s8/6CweTLmngcPrsEH4G6RKvdwmQdC-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-18", 
	"Watched Date": "2023-12-17", 
	"Name": "Indiana Jones and the Dial of Destiny", 
	"Year": "2023", 
	"Rating": "2", 
	"Review": "Underwhelmed with the stunts, 57 car chases and believability of it all. Watching old guys attempt sprinting is pure comedy. The several unexplainable, unbelievable, unreliable moments forces the audience to put up with a charade of a story. The film starts at a high pace but ends in such a lackluster, unsatisfactory manner. That said, the emphasis on early exposition pays off throughout the film as with all Indy films.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/6/5/4/3/3/265433-indiana-jones-and-the-dial-of-destiny-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-21", 
	"Watched Date": "2023-12-20", 
	"Name": "Oppenheimer", 
	"Year": "2023", 
	"Rating": "5", 
	"Review": "Helluva way to end a film; charging towards the finish line in a hurried yet somber manner.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/8/4/3/2/8/784328-oppenheimer-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-24", 
	"Watched Date": "2023-12-23", 
	"Name": "The Whale", 
	"Year": "2022", 
	"Rating": "3.5", 
	"Review": "Difficult to watch. Charlie is the physical manifestation of consequence, grief and lack of control. Rarely do you see addiction portrayed as brutally honest as this. While wrestling with imminent death and broken relationships, he holds an optimistic flame for the goodness in people. Has it’s cheesy moments. Beautiful performances from Brendan Fraser and Sadie Sink.<br/><br/><blockquote>Do you ever get the feeling that people are incapable of not caring. People are amazing.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/0/3/4/7/8/703478-the-whale-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-29", 
	"Watched Date": "2023-12-28", 
	"Name": "The Batman", 
	"Year": "2022", 
	"Rating": "3.5", 
	"Review": "The narrative stays as tight as a crime drama can and should. The whole “dirty cops and state officials” plot is overdone; but the writers seem to breathe life into it with the Wayne and Falcone family drama. It lost it’s luster near the end. The narration was too melodramatic. Outstanding soundtrack. Gorgeous cinematography. We’ve been waiting for this angry Batman.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/4/8/9/1/4/348914-the-batman-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-29", 
	"Watched Date": "2023-12-28", 
	"Name": "Maestro", 
	"Year": "2023", 
	"Rating": "2.5", 
	"Review": "The story opened up several substories within but left some unclosed. The narrative felt incomplete, lacking depth and cohesion. The purpose and message is lost on me. I was in love with the cinematography. Shots were significantly longer than the contemporary average. Both Bradley Cooper and Carey Mulligan transform in their roles; outstanding performances.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/5/3/0/6/9/453069-maestro-0-230-0-345-crop.jpg"
},
{
	"Date": "2023-12-30", 
	"Watched Date": "2023-12-30", 
	"Name": "The Iron Claw", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "A beautifully tragic story championing brotherly love and the search for approval. Powerful and moving. I cried.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/6/4/8/9/0/764890-the-iron-claw-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-01", 
	"Watched Date": "2023-12-31", 
	"Name": "Barbie", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "Hyperbolic Satire at its best. Ryan Gosling deserves an Oscar.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/7/7/0/6/4/277064-barbie-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-07", 
	"Watched Date": "2024-01-06", 
	"Name": "Band of Brothers", 
	"Year": "2001", 
	"Rating": "5", 
	"Review": "Imagine sharing a life’s worth of tragedy, laughter and turmoil with the most honorable league of men, exploring the world’s most dangerous and most beautiful places in only a few short years. The war’s end meant leaving those friendships behind to go home to loved ones and seek a peaceful life. It must’ve left a hefty toll on the soul.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/2/5/9/0/1/1/259011-band-of-brothers-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-11", 
	"Watched Date": "2024-01-10", 
	"Name": "L.A. Confidential", 
	"Year": "1997", 
	"Rating": "3.5", 
	"Review": "A complex and satisfying story", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/3n/0w/ax/pt/rIXzJCAvyd3Ci8ipylDQ5wUKqwh-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-15", 
	"Watched Date": "2024-01-14", 
	"Name": "Training Day", 
	"Year": "2001", 
	"Rating": "4.5", 
	"Review": "Denzel Washington shines as a crooked cop on the verge of demented chaos; too blinded to see his own demise. He maintains a mirage of emotions throughout.<br/><br/>Over the course of the film, the narrative seemed to shift protagonist perspectives. Alonzo certainly feels like the main character for the first half of the film. I say that because he holds a majority of the dialogue and screen time whereas Hoyt dominates the second half.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/0/5/8/0/50580-training-day-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-18", 
	"Watched Date": "2024-01-17", 
	"Name": "Spider-Man: Across the Spider-Verse", 
	"Year": "2023", 
	"Rating": "5", 
	"Review": "Animation in it’s most exquisite and elaborate form.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/9/7/6/3/1/497631-spider-man-across-the-spider-verse-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-20", 
	"Watched Date": "2024-01-19", 
	"Name": "Jackie Brown", 
	"Year": "1997", 
	"Rating": "3.5", 
	"Review": "Like most Tarantino films, the dialogue is often purposeless but so compellingly close to the way people actually interact.<br/><br/>In many sequences, character A and character B are talking about another off-screen character C. Louis and Ordell talking about Melanie. Melanie and Louis talking about Ordell. Ray and Jackie talking about Ordell, Melanie and Louis. Max and Ordell talking about Jackie. These conversations seem create a myth of the off-screen character; allowing the audience to build assumptions about the character’s motives and intuitions. Cool narrative technique.<br/><br/>Michael Keaton shooting a pistol in a pair of socks and Tevas will never be topped.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/08/3j/am/rx/4XVPYOdMAizdNMSwS0SK3fPJcvR-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-21", 
	"Watched Date": "2024-01-20", 
	"Name": "Minari", 
	"Year": "2020", 
	"Rating": "4", 
	"Review": "1980s America: where an Immigrant family of four can purchase a farm and tractor off two hourly jobs and no child care.<br/><br/>A beautiful and intimate story. Gaining something means leaving something else behind. Made me think about my upbringing on our Wichita farm and how dedicated my dad was to its success in the face of unforgiving weather.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/4/2/4/4/9/542449-minari-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-25", 
	"Watched Date": "2024-01-24", 
	"Name": "The Florida Project", 
	"Year": "2017", 
	"Rating": "5", 
	"Review": "<blockquote>I can always tell when adults are about to cry</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/2/8/5/3/8/328538-the-florida-project-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-27", 
	"Watched Date": "2024-01-26", 
	"Name": "Poor Things", 
	"Year": "2023", 
	"Rating": "4.5", 
	"Review": "So well written. The dialogue is so Shakespearean and aloof and diabolically funny. Bella says the truest things to the moment. Mark Ruffalo murders this role.<br/><br/><br/>The sets were straight out of a Tim Burton-infused Emerald City Whoville. Regarding cinematics, way too much fish eye and extra wide angles; it wasn’t working for me.<br/><br/>Willem Defoe acting in a movie where a sequence includes several moorish idol fish, the same species of fish that Willem played in Finding Nemo, is NOT a coincidence.<br/><br/>Would not recommend to the average moviegoer.. very uncomfortable.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/1/0/3/5/2/710352-poor-things-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-01-28", 
	"Watched Date": "2024-01-27", 
	"Name": "Killers of the Flower Moon", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "A very enticing retelling of the Osage Indian Murders. Felt very similar to the Irishman in tone and sensation. That said, I was wanting more out of the narrative; The story was just the retelling. Some embellishments were made like with any good historical fiction, but not much. By the time Ernest gets arrested, the whole film slows to a halt.<br/><br/>Gorgeous cinema.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/3/9/8/0/0/9/398009-killers-of-the-flower-moon-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-02-29", 
	"Watched Date": "2024-02-28", 
	"Name": "Ice Merchants", 
	"Year": "2022", 
	"Rating": "5", 
	"Review": "Daring, disciplined and caring all the while subtly grieving.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/6/8/5/6/5/868565-ice-merchants-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-03-01", 
	"Watched Date": "2024-02-29", 
	"Name": "1883", 
	"Year": "2021", 
	"Rating": "4", 
	"Review": "The journey is where heaven and hell meet", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/8/2/4/7/1/882471-1883-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-03-03", 
	"Watched Date": "2024-03-02", 
	"Name": "The Secret of NIMH", 
	"Year": "1982", 
	"Rating": "4", 
	"Review": "creepy af but wonderful story. Formative for kids.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/5/0/5/0/45050-the-secret-of-nimh-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-03-03", 
	"Watched Date": "2024-03-02", 
	"Name": "Dune: Part Two", 
	"Year": "2024", 
	"Rating": "4.5", 
	"Review": "Performances were brilliant. A powerful addition to the Dune saga bringing in several new characters and plot complexity. Lady Jessica and Paul enter the film as refugees and exit the film with new names, powers and prophetic motives. The sound design and score elevate the chaos. The supporting cast organize into prophecy zealots and power zealots.. and then there is Chani; not religious or power-hungry, just in love snd seeking restoration.<br/><br/>Throughout, there are musically-charged, slow-motion, momentous sequences that are made to give weight to moments. This is a more common trope in contemporary blockbusters but it doesn’t give to the film as a whole. Just a cheap hype tool in my opinion.<br/><br/>Performances were brilliant, especially Florence Pugh, Dave Bautista, Austin Butler and Christopher Walken. Javier Bardem didn’t deserve to be comedic relief.<br/><br/><blockquote><b>Gurney: The prophet. Why is that a bad thing? Use it.<br/></b><i>Paul: Because all my visions lead to horror.<br/></i><b>Because you lose control.<br/></b><i>Because I gain it.</i></blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/6/1/7/4/4/3/617443-dune-part-two-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-03-21", 
	"Watched Date": "2024-03-20", 
	"Name": "Bodies Bodies Bodies", 
	"Year": "2022", 
	"Rating": "2.5", 
	"Review": "The use of light, specifically from cell phones, gave this film a unique, modern style. The story was crap; maybe I’m biased but rich millennials murdering each other isn’t very interesting.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/4/4/9/4/4/2/449442-bodies-bodies-bodies-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-04-06", 
	"Watched Date": "2024-04-05", 
	"Name": "The Patriot", 
	"Year": "2000", 
	"Rating": "4", 
	"Review": "A heroic tall tale of one man’s reluctant and vengeful journey through the Revolutionary War. This is a love letter to the ordinary men who fought for liberty. You can’t help getting swept up in the grandeur of it, as I clearly did. One of my favorites as a child.<br/><br/>Some of the relationships were cliche, only included as an excuse for romance or a societal metaphor. The post production was poor; too much slow motion.<br/><br/><blockquote>I’m a parent. I haven’t got the luxury of principles.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/0d/33/fj/4k/xuckWVcUGg7ZGU9b5U8CQDUr1RO-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-04-27", 
	"Watched Date": "2024-04-26", 
	"Name": "Pirates of the Caribbean: Dead Man's Chest", 
	"Year": "2006", 
	"Rating": "4", 
	"Review": "Conflicting interests and layered plot points make for an excellent story. Jack Sparrow is the definition of internal conflict. This is the Empire Strikes Back of Pirate cinema", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/9/8/9/51989-pirates-of-the-caribbean-dead-man-s-chest-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-04-29", 
	"Watched Date": "2024-04-28", 
	"Name": "Pirates of the Caribbean: At World's End", 
	"Year": "2007", 
	"Rating": "4", 
	"Review": "I’m convinced this is where Disney mastered the ‘trilogy’ concept; triumphant, avenging and sacrificial.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/5/1/7/7/3/51773-pirates-of-the-caribbean-at-world-s-end-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-05-18", 
	"Watched Date": "2024-05-18", 
	"Name": "Civil War", 
	"Year": "2024", 
	"Rating": "3", 
	"Review": "Surreal; unrealistic at times. Reveals the primality and grit of journalism. Balances chaotic war environments with an eclectic off-kilter soundtrack; offputting at first but eventually felt right.", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/8/3/4/6/5/6/834656-civil-war-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-05-31", 
	"Watched Date": "2024-05-30", 
	"Name": "Inception", 
	"Year": "2010", 
	"Rating": "3.5", 
	"Review": "Has all the elements of a great heist flick with a twist of sci-fi technicality and exposition. Opposite the opinions of others, this was easier to follow along with as it goes for a Nolan narrative. Nolan kept sprinkling new twists and concepts up until the end; keeping the story thrilling and the audience curious.", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/sv/95/s9/4j/inception-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-06-17", 
	"Watched Date": "2024-06-16", 
	"Name": "The Holdovers", 
	"Year": "2023", 
	"Rating": "4", 
	"Review": "Felt gentle; soft, sensory sound design and classic fade transitions. Several scenes are introduced by portraits of famous faculty and alumni; showing off Barton’s prestige and pomp.<br/><br/>The bond between Angus and Mr. Hunham is paved by dishonest antics.Mr. Hunham’s message to the delinquents is “Barton men don’t lie”. He disciplines those that defy and he catches Angus numerous times doing so. During their time together, Angus and Hunham lie to others in order to protect themselves or preserve their dignity.With the continued dishonesty comes mild debauchery and camaraderie, crafting a strong bond between the two holdovers. Eventually this all leads to a pivotal moment where Hunham goes against his school’s values to save Angus’ future at his own peril.<br/><br/><blockquote>Believe it or not Mr. Tully, there was a time when the fire in my loins burned white hot.</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/film-poster/7/5/5/5/6/4/755564-the-holdovers-0-230-0-345-crop.jpg"
},
{
	"Date": "2024-06-18", 
	"Watched Date": "2024-06-17", 
	"Name": "The Thing", 
	"Year": "1982", 
	"Rating": "4.5", 
	"Review": "High quality animatronics and practical effects. Flawless storytelling.<br/><br/><blockquote><i><b>How long will we make it?</b></i><br/>Maybe we shouldn’t</blockquote>", 
	"PosterURL": "https://a.ltrbxd.com/resized/sm/upload/t3/qn/vs/p5/s5fH3GqFcHbi2F0NSBSh4KRNTc0-0-230-0-345-crop.jpg"
}
] }